* Tasks
:PROPERTIES:
:CATEGORY: Tasks
:END:
#+BEGIN: clocktable :maxlevel 4 :scope subtree
#+CAPTION: Clock summary at [2018-11-26 周一 22:37]
| Headline                                                             | Time     |          |       |       |
|----------------------------------------------------------------------+----------+----------+-------+-------|
| *Total time*                                                           | *21d 6:41* |          |       |       |
|----------------------------------------------------------------------+----------+----------+-------+-------|
| Tasks                                                                | 21d 6:41 |          |       |       |
| \_  Get Things Done                                                  |          |    10:49 |       |       |
| \_    2. you capture your todos with time,...                        |          |          | 10:49 |       |
| \_      clojure学习 <2017-11-20 周一 13:52 +1w>                      |          |          |       | 10:49 |
| \_  开题报告+文献综述+中央高校基金                                   |          |     0:53 |       |       |
| \_  turbsim reading   [2017-10-15 周日...                            |          |     0:48 |       |       |
| \_  干好一件事 <2017-10-16 周一 23:48>                               |          |     0:01 |       |       |
| \_  确认长峪城下雨情况 <2017-10-18 周三 14:39>                       |          |     0:01 |       |       |
| \_  Somethings need to be done by...                                 |          |     0:01 |       |       |
| \_  SCI结果后处理 <2017-10-21 周六 21:58>                            |          |     0:50 |       |       |
| \_  [100%]入党申请 <2017-10-24 周二 15:38>                           |          |     0:05 |       |       |
| \_  strggle(1.02^365=1377.4) <2017-10-26...                          |          |     0:04 |       |       |
| \_  [100%]查新报告 <2017-10-27 周五 12:48>                           |          |     0:05 |       |       |
| \_  番茄时间(30min) <2017-10-28 周六 16:21 >                         |          |     0:02 |       |       |
| \_  工程热物理会议ppt <2017-11-01 周三 16:42>...                     |          |  4d 5:26 |       |       |
| \_  两圈风轮20 30 60收集 <2017-11-02 周四 20:48>                     |          | 1d 19:50 |       |       |
| \_  机舱偏航绘制 <2017-11-15 周三 10:44>                             |          |  1d 3:01 |       |       |
| \_  3页的报告 <2017-11-17 周五 13:05>                                |          |  1d 2:25 |       |       |
| \_  [100%]舍友属性约减程序 <2017-11-17 周五 13:22>                   |          |     0:01 |       |       |
| \_  领取开题报告查新报告并打印开题报告及文献综述 <2017-11-20 周一... |          |     0:01 |       |       |
| \_  SPACECLaim前处理几何 <2017-11-21 周二 22:38>                     |          |     0:01 |       |       |
| \_  提交基金进展报告 <2017-12-01 周五 14:40>                         |          |     0:01 |       |       |
| \_  流场可视化专利申请 <2017-12-06 周三 14:53>                       |          |     0:01 |       |       |
| \_  本科校友聚会 <2017-12-07 周四 01:10>                             |          |  1d 7:40 |       |       |
| \_  中央高校基金写作 <2017-12-08 周五 08:46>                         |          | 1d 13:17 |       |       |
| \_  attengding xilei wedding <2018-01-01...                          |          |     0:01 |       |       |
| \_  年后报增 <2018-01-26 周五 17:30>                                 |          |     0:02 |       |       |
| \_  如鹏提高docker <2018-01-30 周二 15:19>                           |          |     0:01 |       |       |
| \_  提交文章初稿给王老师 <2018-02-04 周日 11:43>                     |          |     0:01 |       |       |
| \_  Capture the Class name in project...                             |          |     5:35 |       |       |
| \_  查阅energy投稿信息 <2018-05-23 周三 17:08>                       |          |     0:21 |       |       |
| \_  Tourist <2018-06-12 周二 20:53>                                  |          | 7d 14:09 |       |       |
| \_  取工程热物理发票 <2018-07-31 周二 16:05>                         |          |     0:01 |       |       |
| \_  校医院取外敷药 <2018-07-31 周二 16:17>                           |          |     0:19 |       |       |
| \_  2018论文版面费 <2018-09-07 周五 19:17>                           |          |     0:01 |       |       |
| \_  修改2018工程热物理录用全文 <2018-09-07 周五 19:18>               |          |     0:01 |       |       |
| \_  学习Excel <2018-10-08 周一 17:09 >                               |          |    17:18 |       |       |
| \_    4. Recorded Macros                                             |          |          |  0:09 |       |
| \_    5. Charts                                                      |          |          |  2:54 |       |
| \_    2017版本                                                       |          |          | 14:10 |       |
| \_      power query                                                  |          |          |       | 12:40 |
| \_  车管所换证 <2018-10-20 周六 15:27>                               |          |     0:01 |       |       |
| \_  李涛PS高手进阶之路 <2018-11-07 周三 20:21>                       |          |    23:20 |       |       |
| \_  确认康老师入住宾馆 <2018-11-13 周二 13:21>                       |          |     0:03 |       |       |
| \_  内工大博士交流 <2018-11-21 周三 18:07>                           |          |     0:04 |       |       |
#+END:



** DONE java learning,you should take care the XML                    :javaxml:
CLOSED: [2017-12-11 周一 19:56]

- State "DONE"       from "TODO"          [2017-12-11 周一 19:56]
Added: [2015-05-03 Sun 19:04]
** DONE finish a learning report about the java                       :javaxml:
CLOSED: [2017-12-11 周一 19:56]
- State "DONE"       from "TODO"          [2017-12-11 周一 19:56]
   - 
Added: [2015-05-03 Sun 19:17]
** DONE TODOS setting CFD calculation                                :@work:
CLOSED: [2017-09-29 周五 23:41] SCHEDULED: <2017-09-13 周三>
 
- State "DONE"       from              [2017-09-29 周五 23:41]
 Added: [2017-09-13 周三 01:22]
*dfdf* 
 /slash/
** CANCELED TODOS  read the elisp code                                      :@F708:
CLOSED: [2018-06-27 周三 15:35]

- State "CANCELED"   from              [2018-06-27 周三 15:35]
Jumping to code

(define-key emacs-lisp-mode-map (kbd "C-c .") 'find-function-at-point)
(bind-key "C-c f" 'find-function)


Added: [2017-09-27 周三 17:50]
** DONE find the army software
CLOSED: [2017-12-11 周一 19:56]
:PROPERTIES:
:Effort: 0:15
:END:
- State "DONE"       from "TODO"          [2017-12-11 周一 19:56]
Captured 2017-09-27 22:52
** 学习 Get Things Done
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "学习"       from "TODO"          [2018-06-27 周三 15:35]
                    Captured 2017-09-28 11:21
*** 1. you capture the ideas or todos(capture--refile--consider,organize---review---do)
*** 2. you capture your todos with time, so you have time pocket(momentum); However
**** PENDING [#B] clojure学习 <2017-11-20 周一 13:52 +1w>          :@F708:
                    :PROPERTIES:
                    :Effort: 1:00
                    :LAST_REPEAT: [2017-12-22 周五 10:38]
                    :END:
                    
                    - State "DONE"       from "PENDING"    [2017-12-22 周五 10:38]
                    :LOGBOOK:
                    CLOCK: [2017-11-22 周三 12:07]--[2017-11-22 周三 13:38] =>  1:31
                    CLOCK: [2017-11-21 周二 17:51]--[2017-11-21 周二 22:38] =>  4:47
                    CLOCK: [2017-11-21 周二 15:42]--[2017-11-21 周二 17:20] =>  1:38
                    CLOCK: [2017-11-21 周二 10:57]--[2017-11-21 周二 11:23] =>  0:26
                    CLOCK: [2017-11-20 周一 10:13]--[2017-11-20 周一 11:46] =>  1:33
                    CLOCK: [2017-11-16 周四 13:52]--[2017-11-16 周四 14:46] =>  0:54
                    :END:
                    
                    
https://github.com/marshallshen/clojure-katas  clojure-katas
我挺喜欢firefox 中的vimEx的y功能，复制当前的网址到剪贴板

https://www.braveclojure.com/writing-macros/
the macro has a name, an optional document string, an argument list
also a body, just like function. The body will almost return a list.

macro can be recursive and also use the rest arguments list with `& next`

第二次学习
<2017-11-20 10:13>


Clojure needn't type declaration; clojure have many walls of data and function, so as to 
build a big building.

Clojure need you to keep focus on the code, to think the syntax of programming, to think th
hierarchy of inheritance,to think the data structure. Writing code(or just writing)is against
to the distraction.

"It is better to have 100 functions operate on one data structure than to have 10 functions 
operate on 10 data structures." - Alan J. Perlis


第三次学习
<2017-11-21 10:59>

+ sequential  +sequence  + seq
they mean specific things in Clojure

1. Collection: A composite data types
2. sequential : ordered series of values  [1 2 3 4] (1 2 3 4)
3. sequence : A sequential collection that may or may not exist yet,(the result of (map a-fun a-colltion)
4. seq :Simple ApI for navigating collections :first ,rest,nil and (){calling seq on a collection}
5. clojure.core/seq:A function that returns an object implementing the seq API :(seq []) ::=> nil and (seq [1 2]):: =>(1 2)


<2017-11-21 15:42>
collection function: filter, map, for, doseq, take, partition...
O(log32n) for those based on the persistent hash trie 
O(log2n)  for the sorted structures.
O(logn) or logarithmic for accessing an element in a clojure persistent structure by index

In practice, you may notice some difference, because for a billion objects O(log2n) would
require approximately 30 comparisons for a lookup, whereas O(log32n) would require only 
about 6.

clojure provides polymorphism via protocols, which let you attach a set of behaviors to 
any number of existing types and classes(similar to mix-ins ,traits, interfaces in other
languages)
we can then use extend-type function, to extent the exist type into many new functions.


#+BEGIN_SRC clojure
(defprotocol Concatenatable
   (cat [this other]))

(extend-type String
   Concatenatable
   (cat [this other]
      (.concat this other)))

(extend-type java.util.List
   Concatenatable 
   (cat [this other]
      (concat this other)))


#+END_SRC




*** 2.5 however, you will be overwhelmed by tasks, so you can also group tasks into projects or context.(group tasks into project)
*** 3. List your todos or tasks with routines and checklists, so you can do things consistently even if fuzzy brains
*** 5. but still too much. So be realistics and add priviledge to your schedule tasks, eliminate some not so important not so hurry
*** 6. finally you track all you task (so you know what the time went by)
*** 7. also you do some overview the process (so you do appreciate how things adds up)
** DONE [#A] new mesh for the double-sliding mesh        :学术:@work::紧急重要:
CLOSED: [2017-09-29 周五 23:40] SCHEDULED: <2017-09-28 周四>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"       [2017-09-29 周五 23:40]
                    Captured 2017-09-28 13:52
** DONE [#B] Read papers related to yaw preparing for the thesis proposal :学术:@work::紧急重要:
SCHEDULED: <2017-10-13 周五 +1w>
:PROPERTIES:
:LAST_REPEAT: [2018-06-27 周三 15:06]
:END:

                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-09-28 13:58
** DONE [#B] change the list style in org-mode                    :PERSONAL:
CLOSED: [2017-09-29 周五 09:45] DEADLINE: <2017-09-28 周四>
                    :PROPERTIES:
                    :Effort: 0:15
                    :END:
                    - State "DONE"       from "TODO"       [2017-09-29 周五 09:45]
                    Captured 2017-09-28 14:07
                Doesn't work!                   
** DONE [#B] First Report for your graduation                           :@work:
CLOSED: [2017-10-26 周四 10:30] DEADLINE: <2017-10-23 周一> SCHEDULED: <2017-10-02 周一>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:30]
                    Captured 2017-10-02 11:05
** DONE [#A] 开题报告+文献综述+中央高校基金                             :@work:
CLOSED: [2017-10-26 周四 10:29] DEADLINE: <2017-10-22 周日> SCHEDULED: <2017-10-03 周二>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:29]
                    :LOGBOOK:
                    CLOCK: [2017-10-14 周六 23:42]--[2017-10-15 周日 00:29] =>  0:47
                    CLOCK: [2017-10-14 周六 23:30]--[2017-10-14 周六 23:36] =>  0:06
                    :END:
                    Captured 2017-10-03 14:15
       开题报告得包含以下几个部分，
***** DONE 数值模拟 静态偏航+动态偏航+ 流固耦合(参考仇永兴 姚世刚 陈晓明 范钟瑶 李媛 任会来) [0%]
CLOSED: [2018-11-30 周五 11:25]
:LOGBOOK:
- State "DONE"       from "ABORT"      T:[2018-11-30 周五 11:26]
- State "ABORT"      from "TODO"          T:[2018-11-30 周五 11:25] \\
  已在其他部分分解
:END:
- State "TODO"       from "TODO"       [2017-10-03 周二 14:25]
- State "TODO"       from "ABORT"      [2017-10-03 周二 14:25] [ ] 
- [-] 任务分解 [20%]
  1. [ ] 背景介绍
     1. [ ]《风电13五规划》
     2. [ ]《2006-2016风电装机容量发展》
     3. [ ]《2016年度全球风电报告》 4%占全球总发电量
     4. [ ] 气弹非稳定性
  2. [X] 静态偏航
  3. [-] 动态偏航
     1. [X] 动态入流角
        在cfx的结果，暂时以失败告终。
     2. [ ] 机舱偏航
  4. [-] 流固耦合(参考姚世刚 李媛 李新凯 陈晓明)
     1. [X] 单向
     2. [ ] 双向
  5. [ ] FVM 自由涡尾迹(参考仇永兴)
#+REVEAL: split
***** TODO 实验部分 NREL5MW的数值模拟(参考赵宗德 周广鑫 李新凯) [0%]
- State "TODO"       from              [2017-10-03 周二 14:25]
- [ ] 任务分解
  - [ ] NREL5MW的实验研究
    - [ ] 叶片介绍
    - [ ] 轮毂+塔架介绍
    - [ ] 控制系统介绍
    - [ ] 实验方案介绍
      - [ ] 偏航实验
      - [ ] 前后四周晃动实验
  - [ ] 丝线实验 流场可视化实验
** DONE [#B] 办理工程热物理注册问题   [100%]                           :@work:
CLOSED: [2017-10-11 周三 17:48] DEADLINE: <2017-10-11 周三> SCHEDULED: <2017-10-08 周日>
:PROPERTIES:
:END:


- State "DONE"       from "TODO"         [2017-10-11 周三 17:48]
- State "TODO"       from "TODO"         [2017-10-11 周三 17:48]
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "TODO"       from "DOING"          [2017-10-09 周一 15:52]
                    - State "DOING"      from "TODO"          [2017-10-09 周一 02:25]
                    Captured 2017-10-08 22:29

1. [X] 询问财务处，9号办理汇款是否可以在10号前拿到汇款凭证
       当天上午办理 当天下午即可查询，并且可以拖上几天，只要跟裴老师说一声即可
2. [X] 询问是否需要统一汇款还是分开汇款(分开回执，估计是分开汇款）
       可以统一汇款，备注相关信息即可
- 汇款账号

#+BEGIN_EXAMPLE
户名：江苏大学镇江流体工程装备技术研究院
银行：农业银行镇江江大支行（行号：1033 1403 1235）
账号：1031 2301 0400 0615 2
纳税人识别号：3211 0046 8697 050 
银行地址：镇江新区丁卯经十五路99号国家大学科技园D43楼

#+END_EXAMPLE

电话联系人：
联系人：裴吉，手机：13776474939

1. [X] 务必在回执邮件落款著名联系人姓名、手机和邮箱
2. [X] 回执邮件中请务必将转账/汇款凭证扫描件附在邮件中一起发送
3. [X] 务必在汇款备注中注明“参会编号（GJ-XX）-发票抬头-第一位作者姓名”，例如“GJ-015-清华大学-李四”
4. [X] 确认康老师的住房预定问题
5. [X] 10月11号 周三办理 汇款程序
** DONE [#B] Doing sports(must be)                                  :@Dormitry:
CLOSED: [2018-01-28 周日 18:42] SCHEDULED: <2017-10-12 周四 >
                    :PROPERTIES:
                    :Effort: 1:00
                    :style: habit
                    :LAST_REPEAT: [2017-11-02 周四 21:23]
                    :END:
                    - State "DONE"       from "PENDING"    [2018-01-28 周日 18:42]
                    - State "DONE"       from "PENDING"    [2017-11-02 周四 21:22]
                    - State "DONE"       from "TODO"          [2017-10-09 周一 20:55]
                    Captured 2017-10-09 15:53
 坚持每一天都做运动
** DONE [#C] 提醒王老师旋转对风轮转捩的影响
CLOSED: [2017-10-18 周三 13:29] DEADLINE: <2017-10-16 周一> SCHEDULED:<2017-10-12 周四>
- State "DONE"       from "TODO"          [2017-10-18 周三 13:29]
** DONE [#B] 通知赵老板安装推力软件                                     :@work:
CLOSED: [2017-10-26 周四 10:30] DEADLINE: <2017-10-21 周六>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:30]
                    Captured 2017-10-13 21:20
** CANCELED [#B] turbsim reading   [2017-10-15 周日 00:58-02:08]
CLOSED: [2018-06-27 周三 15:36]
:PROPERTIES:
:END:
- State "CANCELED"   from "TODO"          [2018-06-27 周三 15:36]
                                                         :@work:
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-15 周日 01:24]--[2017-10-15 周日 01:25] =>  0:01
                    CLOCK: [2017-10-15 周日 00:31]--[2017-10-15 周日 01:18] =>  0:47
                    CLOCK: [2017-10-15 周日 00:30]--[2017-10-15 周日 00:30] =>  0:00
                    :END:
                    Captured 2017-10-15 00:29
                    
刘文为主
** DONE [#B] 干好一件事 <2017-10-16 周一 23:48>                         :@work:
CLOSED: [2018-11-19 周一 23:24]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "学习"       from "TODO"          [2018-06-27 周三 15:36]
                    :LOGBOOK:
                    - State "DONE"       from "学习"       T:[2018-11-19 周一 23:24]
                    CLOCK: [2017-10-16 周一 23:48]--[2017-10-16 周一 23:49] =>  0:01
                    :END:
                    
                    
全年一件事，干好一件事即可！
男人能干好一件事即可
** DONE [#B] 确认长峪城下雨情况 <2017-10-18 周三 14:39>                :@NCEPU:
CLOSED: [2017-10-21 周六 00:51] DEADLINE: <2017-10-19 周四>
                    :PROPERTIES:
                    :Effort: 0:05
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-21 周六 00:51]
                    :LOGBOOK:
                    CLOCK: [2017-10-18 周三 14:39]--[2017-10-18 周三 14:40] =>  0:01
                    :END:
** CANCELED [#B] 中科院赵明多轴角运动 <2017-10-18 周三 20:48>               :@work:
CLOSED: [2018-06-20 周三 11:07]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "CANCELED"   from "TODO"          [2018-06-20 周三 11:07]
                    :LOGBOOK:
                    CLOCK: [2017-10-18 周三 20:49]--[2017-10-18 周三 20:49] =>  0:00
                    :END:
                    
                    
探讨fluent的udf多轴角编写问题
** DONE [#B] 完成入党申请资料 <2017-10-19 周四 19:52>                   :@F708:
CLOSED: [2017-10-26 周四 11:07]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 11:07]
                    :LOGBOOK:
                    CLOCK: [2017-10-19 周四 19:53]--[2017-10-19 周四 19:53] =>  0:00
                    :END:
                    
                    
入党申请
** DONE [#B] [100%]学习sketchup和几何画板 <2017-10-19 周四 20:02>       :@work:
CLOSED: [2017-12-11 周一 19:57] SCHEDULED: <2017-10-26 周四>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-11 周一 19:57]
                    :LOGBOOK:
                    CLOCK: [2017-10-19 周四 20:02]--[2017-10-19 周四 20:02] =>  0:00
                    :END:
                    
                    
抓紧提个时间学习
1. [X] 直线、射线、线段绘制
2. [X] 三点圆弧绘制、圆上弧绘制
3. [X] 三点内部  4点内部  5点内部（CTrl+P)填充内部
4. [X] 直线 点构造圆，通过直线长度控制圆的半径
5. [X] 构造角平分线 垂线  平行线（有约束关系在里头，这句话数学老师不好讲，得有工科背景的学生能说）三角形三条角平分线的焦点构成内心
6. [X] 绘制点的运动轨迹(C-T)  构造---轨迹
7. [X] 利用箭头工具组（包含平移 旋转  缩放三组）
** DONE [#B] Somethings need to be done by yourself <2017-10-21 周六 21:12> :@work:
CLOSED: [2018-11-19 周一 22:22] DEADLINE: <2019-10-21 周一>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "学习"       from "TODO"          [2018-06-27 周三 15:36]
                    :LOGBOOK:
                    - State "DONE"       from "学习"       T:[2018-11-19 周一 22:22]
                    CLOCK: [2017-10-21 周六 21:13]--[2017-10-21 周六 21:14] =>  0:01
                    :END:
                    
                    
Somethings you need to be done by yourself
** DONE [#A] SCI结果后处理 <2017-10-21 周六 21:58>                      :@work:
CLOSED: [2018-04-20 周五 02:21] DEADLINE: <2017-11-06 周一> SCHEDULED: <2017-10-29 周日>
:PROPERTIES:
:Effort:   4:00
:END:
- State "DONE"       from "TODO"          [2018-04-20 周五 02:21]
:LOGBOOK:
CLOCK: [2017-10-21 周六 21:58]--[2017-10-21 周六 22:48] =>  0:50
:END:


关于动态偏航和动态入流，分三个阶段写：定常  非定常（时均解） 动态入流

*** 非定常结果 [%]
1. [ ] 扭矩和推力特性
2. [ ] 极限流线（blade2）
3. [ ] 翼型截面Cp，Cn,Ct
4. [ ] 翼型截面云图


*** 动态入流 [%]
1. [ ] 扭矩和推力特性
2. [ ] 极限流线（blade2）
3. [ ] 翼型截面Cp，Cn,Ct
4. [ ] 翼型截面云图

** DONE [#B] [100%]入党申请 <2017-10-24 周二 15:38>     :@F708:laptop:紧急重要:
CLOSED: [2017-10-29 周日 22:57]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-29 周日 22:57]
                    - State "TODO"       from "DONE"          [2017-10-26 周四 19:10]
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:29]
                    :LOGBOOK:
                    CLOCK: [2017-10-24 周二 15:39]--[2017-10-24 周二 15:44] =>  0:05
                    :END:
                    
                    
1. [X] 入党申请书，手写1份
2. [X] 自传，手写1份
3. [X] 团组织推优为入党积极分子意见表1份
4. [X] 入党积极分子考察表（本）一份 （发通知统一发放） 日(在党支书)
5. [X] 入党积极分子培训班结业证明1份(在党支书)
6. [X] 发展对象培训班结业证明1份(本来应该有，现在没有) 博士不用管
7. [X] 思想汇报（4篇，时间为从确定为积极分子到现在，手写）
8. [X] 党内外座谈记录（党内一份、党外一份，人数要求全班三分之二以上）
9. [X] 发展对象政审表 
10. [X] 入党政审函调表
11. [X]  入党志愿书，1份，（发通知统一发放。） 
12. [X] 补充入党积极分子培养考察表中每个季度的培养考察信息（8次)

博动1543党支部拟于近期讨论接收叶昭良为中共预备党员。现将有关情况公示如下：
叶昭良，男，	1990年1月7日出生，籍贯，硕士学历，，
2001年9月至2004年6月就读于平和县大溪中学，
2004年9月至2007年6月就读于平和县平和一中，
2007年9月至2008年6月复读于泉州一中，
2008年9月至2012年6月于华北电力大学攻读本科学位，
2012年9月至2015年3月于华北电力大学攻读硕士学位，
2015年9月至今于华北电力大学攻读博士学位，现任团支部书记。

1. 2013年9月15日提出入党申请，
2. 2015年12月15日经党支部研究确定为入党积极分子
3. 2017年9月1日被列为发展对象。
4. 2017年10月19日经博动1543党支部开会讨论并投票，
同意发展为预备党员。政治审查合格。


我叫叶昭良，1990年1月7日出生于*市的一个农村家庭，2003年加入共青团组织，
并于2013年出递交了入党申请书，2015年12月确认为入党积极分子，
并积极参加党校的培训，2017年9月列为发展对象
，2017年通过大家的同意列为预备党员。现为华北电力大学博动1543班的团支书
** DONE [#B] strggle(1.02^365=1377.4) <2017-10-26 周四 19:51>           :@work:
CLOSED: [2018-08-23 周四 19:30]
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-08-23 周四 19:30]
                    :LOGBOOK:
                    CLOCK: [2017-10-26 周四 19:51]--[2017-10-26 周四 19:55] =>  0:04
                    :END:
                    
                    
要坚持持续学习的态度!
                    
                    1.01^365 =37.8 
0.99^365 =0.03
如果等式1告诉我们，积硅以致千里，积懒惰以致深渊
1.02^365 = 1377.4
0.98^365 = 0.0006
那么等式2告诉我们，只比你努力一点的人，其实已经甩你很远
曾经有人说过 1.001^365 比 0.999^365 要大得多

1.001^365 = 1.4403(也不能做的太少，不然就进步不大)

0.999^365 = 0.69407
** DONE [#B] [100%]查新报告 <2017-10-27 周五 12:48>                     :@work:
CLOSED: [2017-10-30 周一 20:04] DEADLINE: <2017-11-05 周日>
:PROPERTIES:
:END:

- State "DONE"       from "TODO"          [2017-10-30 周一 20:04]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-27 周五 12:48]--[2017-10-27 周五 12:53] =>  0:05
                    :END:
                    
              
1. [X] 资格考试审核表(617)
2. [X] 开题报告
3. [X] 文献综述
4. [X] 查新报告
请开题通过的同学在11月10日前完成开题材料的递交工作，包括《文献综述与开题报告评审表》+开题报告+文献综述+查新报告，全部材料先交给我。
说明：1.班级内参加24日资格考试的博士生包括在职博士的资格审核表全部在我这里，提交材料时，再将自己的审核表附上即可。
2. 在《文献综述与开题报告评审表》背面需要老师签字的地方，由于在资格考试中像杜老师、徐老师没有参加，在签字过程中仍找这些大老师签字，而不是去找资格考试中代理老师签字。
3. 开题报告和文献综述在打印时封面不要出现“资格考试用”等字眼，且开题报告打印时，由原来的“预开题报告”改作“开题报告”。
4.材料每一项单独装订，之后用曲别针夹上全部材料。
5. 能环专业上交材料的要求一样，按照“资格考试审核表+评审表+开题报告+文献综述+查新报告”顺序排好，准备好后自行提交。
6.仍需单独开题的同学，联系导师开题之后，自己交材料即可。
7.其他年级资格审查表，不在我这里，需要由同组实验室同学通知去F617领取。*  Tasks

** DONE Most important thing that you have to do                :学术:紧急重要:
CLOSED: [2018-11-19 周一 22:22]
:LOGBOOK:
- State "DONE"       from "学习"       T:[2018-11-19 周一 22:22]
:END:

- State "学习"       from "TODO"          [2018-06-27 周三 15:36]
** DONE Second most important thing that you have to do
CLOSED: [2018-11-19 周一 22:22]
:LOGBOOK:
- State "DONE"       from "学习"       T:[2018-11-19 周一 22:22]
:END:
- State "学习"       from "TODO"          [2018-06-27 周三 15:37]
You can also take notes underneath each heading, like this
** DONE 花销(expense)
CLOSED: [2017-12-11 周一 19:56]
[[file:Film/film.org][hello]]
#<<p1>>


- State "DONE"       from              [2017-12-11 周一 19:56]
That's your gtd

| Date              | Category |  Money | People     | Note |
|-------------------+----------+--------+------------+------|
| <2017-10-07 周六> | Book     |   30.6 |            |      |
| <2017-10-09 周一> | Film     |   70.6 |            |      |
| <2017-11-10 周五> | Bus      |   50.2 |            |      |
| <2017-11-11 周六> | Bus      |   60.2 | xinran     |      |
| <2017-11-12 周日> | Eating   |   1000 | Ye         |      |
| <2017-10-30 周一> |          |  +3000 | Yezhaolian |      |
| <2017-10-30 周一> |          |  +3000 | zhujian    |      |
|                   |          |        |            |      |
|-------------------+----------+--------+------------+------|
|                   | Total:   | 1211.6 |            |      |
#+TBLFM: @>$3=vsum(@2..@-1) 


| Date              | Category | Money | People     | Note |   |
|-------------------+----------+-------+------------+------+---|
| <2017-10-30 周一> | 备用     | +3000 | Yezhaolian |      |   |
| <2017-10-30 周一> | 备用     | +7000 | zhujian    |      |   |
| <2017-10-30 周一> | 火车票   | -4000 | zhuijan    |      |   |
|-------------------+----------+-------+------------+------+---|
|                   | Total:   |  6000 |            |      |   |
#+TBLFM: @>$3=vsum(@2..@-1)   

#+REVEAL: split
#+BEGIN_EXAMPLE
@> The @ specifies a row, and this refers to the last row in a table.
    $3 The $ specifies a column, so this refers to the third column.
    vsum A vertical sum function with parameters given in parenthesis
    @2 The second row. Notice that it the Amount header is @1 and the dashes separating the header from the body is ignored.
    @-1 The next to the last row. Using these relative references mean that we can add rows to our table, and still have the sum formula work.


http://www.howardism.org/Technical/Emacs/spreadsheet.html
#+END_EXAMPLE


** TODO [#B] 番茄时间(30min)-for 倒计时 <2017-10-28 周六 16:21>         :@work:
                    :PROPERTIES:
                    :Effort: 0:30
                    :LAST_REPEAT: [2018-12-04 周二 14:06]
                    :END:
                    - State "DONE"       from "PENDING"    [2018-02-08 周四 13:07]
                    - State "DONE"       from "PENDING"    [2018-02-08 周四 13:06]
                    - State "PENDING"    from "PENDING"    [2018-02-08 周四 13:06]
                    - State "DONE"       from "TODO"          [2018-02-08 周四 13:06]
                    :LOGBOOK:
                    - State "TODO"       from "PENDING"    T:[2018-12-04 周二 14:07]
                    - State "DONE"       from "PENDING"    T:[2018-12-04 周二 14:06]
                    CLOCK: [2017-10-28 周六 16:22]--[2017-10-28 周六 16:24] =>  0:02
                    :END:
          #+BEGIN: clocktable :maxlevel 2 :scope subtree
          #+CAPTION: Clock summary at [2017-11-02 周四 21:11]
          | Headline                                        | Time   |      |
          |-------------------------------------------------+--------+------|
          | *Total time*                                    | *0:02* |      |
          |-------------------------------------------------+--------+------|
          | \_  番茄时间(30min) <2017-11-07 周二 16:21 +1w> |        | 0:02 |
          #+END:
          
                    
这就是“番茄时间”，通过倒计时来激发你的决断力和专注力，调动你的情绪和潜能
一般半小时足以，充当时间的衡量(倒计时开始)


番茄时间无处不在

其实番茄时间是无处不在的，比如：

    开心网的偷菜游戏？你是不是老是惦记着收菜的时间？你收的不是菜，是番茄
    奥运会倒计时，高考倒计时？很大很重要的一个番茄
    老板明天要的资料？味道不怎么样的番茄

我想说的是，番茄时间的核心是倒计时所产生的紧迫感。这是中科院心理学专业毕业的
老郭（郭军峰）告诉我的，感谢哦。
** DONE [#B] 工程热物理会议ppt <2017-11-01 周三 16:42>               :@work:jj
CLOSED: [2017-11-14 周二 14:30] DEADLINE: <2017-11-04 周六> SCHEDULED: <2017-11-01 周三>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-11-14 周二 14:30]
                    :LOGBOOK:
                    CLOCK: [2017-11-06 周一 12:52]--[2017-11-09 周四 17:54] => 77:02
                    CLOCK: [2017-11-06 周一 08:55]--[2017-11-06 周一 12:52] =>  3:57
                    CLOCK: [2017-11-05 周日 15:41]--[2017-11-05 周日 18:16] =>  2:35
                    CLOCK: [2017-11-04 周六 21:49]--[2017-11-05 周日 15:41] => 17:52
                    CLOCK: [2017-11-03 周五 11:22]--[2017-11-03 周五 11:22] =>  0:00
                    CLOCK: [2017-11-01 周三 16:43]--[2017-11-01 周三 16:43] =>  0:00
                    :END:
                    
                    
抓紧完成

今年海装的海上风力机达到的最大风轮直径
中国海装H171-5MW（江苏如东），大直径风轮正广泛运用于低风速和超低风速风场，

大悲：我关注的不是什么全球风轮直径最大，而是似乎有这么一个趋势，那就是大直径风轮不仅越来越多用于低风速超低风速市场，
而且也正越来越多用于海上。而且无论海上，还是低风速超低风速市场，同样直径风轮的风机，直驱机型的发电功率均明显高于
双馈机型。与海装推出H171-5MW机组几乎同步，金风最近在山东海上开始推介GW171/6.45MW风机，这意味着以往我们认为长江口
以北海域较为适合4MW风机，但如果叶轮直径逐步增大，则陆上4MW，5MW风机肯定会逐步普及，而海上很可能越过4MW风机，起步
就是5MW，甚至6MW，如此金风海上或许已无必要再研发6MW以下海上新型风机，而是直接从3MW跳到6MW平台，之后再向10MW平台迈进。具体如何，让我们且走且看！

http://dabei2006.blog.hexun.com/113493152_d.html  大悲金风科技


大家好，我叫叶昭良，本次我报告的论文题目是风力机的偏航
气动特性分析，报告的主题部分包含以下几个部分 背景和意义 


*** 普遍存在的问题
随着风电机组大型化，叶片和塔架的柔性增加。前一阶段风轮的最大直径一直是
西门子164m风电机组，而今年8月份海装推出了171m的5MW海上风电机组，进一步
加大了风轮直径。在风力机变大的前提下，而中国地区的风力机大多处于山地地形中
，普遍存在着偏航入流和偏航入流

*** 气动设计问题
风力机的工程设计方法通常基于

** DONE [#B] 两圈风轮20 30 60收集 <2017-11-02 周四 20:48>               :@work:
CLOSED: [2017-12-11 周一 19:56]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-11 周一 19:56]
                    :LOGBOOK:
                    CLOCK: [2017-11-03 周五 11:22]--[2017-11-04 周六 16:41] => 29:19
                    CLOCK: [2017-11-02 周四 21:04]--[2017-11-03 周五 11:22] => 14:18
                    CLOCK: [2017-11-02 周四 21:00]--[2017-11-02 周四 21:04] =>  0:04
                    CLOCK: [2017-11-02 周四 20:51]--[2017-11-02 周四 20:59] =>  0:08
                    CLOCK: [2017-11-02 周四 20:49]--[2017-11-02 周四 20:50] =>  0:01
                    :END:
                    
               
30-60 计算30°
WZ-YZL计算60°(180步  每隔2步保存一次)
Node7计算20°(BookYZL)     
** DONE [#B] spaceClaim 参考 <2017-11-06 周一 12:52>                    :@work:
CLOSED: [2017-12-22 周五 10:39]
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-22 周五 10:39]
                    :LOGBOOK:
                    CLOCK: [2017-11-06 周一 12:52]--[2017-11-06 周一 12:52] =>  0:00
                    :END:
                    
                    
http://help.spaceclaim.com/2017.0.0/zh-Hans/
花点时间思考
** DONE [#B] 机舱偏航绘制 <2017-11-15 周三 10:44>                       :@work:
CLOSED: [2017-12-11 周一 19:56]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-11 周一 19:56]
                    :LOGBOOK:
                    CLOCK: [2017-11-15 周三 16:49]--[2017-11-16 周四 13:51] => 21:02
                    CLOCK: [2017-11-15 周三 11:07]--[2017-11-15 周三 16:48] =>  5:41
                    CLOCK: [2017-11-15 周三 10:49]--[2017-11-15 周三 11:07] =>  0:18
                    CLOCK: [2017-11-15 周三 10:44]--[2017-11-15 周三 10:44] =>  0:00
                    :END:
** DONE [#B] 球形晃动网格绘制 <2017-11-15 周三 10:47>                   :@work:
CLOSED: [2017-12-11 周一 19:56]
                    :PROPERTIES:
                    :Effort: 10:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-11 周一 19:56]
                    :LOGBOOK:
                    CLOCK: [2017-11-15 周三 10:49]--[2017-11-15 周三 10:49] =>  0:00
                    CLOCK: [2017-11-15 周三 10:47]--[2017-11-15 周三 10:47] =>  0:00
                    :END:
** DONE [#B] 风洞试验NREL5MW 错误排除 <2017-11-15 周三 11:06>           :@work:
CLOSED: [2018-11-19 周一 22:22]
                    :PROPERTIES:
                    :Effort: 6:00
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-11-19 周一 22:22]
                    CLOCK: [2017-11-15 周三 11:07]--[2017-11-15 周三 11:07] =>  0:00
                    :END:
** DONE [#B] 3页的报告 <2017-11-17 周五 13:05>               :@work:紧急不重要:
CLOSED: [2017-12-05 周二 12:10] DEADLINE: <2017-11-24 周五> SCHEDULED: <2017-11-22 周三>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-05 周二 12:10]
                    :LOGBOOK:
                    CLOCK: [2017-11-20 周一 22:37]--[2017-11-21 周二 10:57] => 12:20
                    CLOCK: [2017-11-20 周一 21:00]--[2017-11-20 周一 22:36] =>  1:36
                    CLOCK: [2017-11-19 周日 21:49]--[2017-11-20 周一 10:09] => 12:20
                    CLOCK: [2017-11-17 周五 13:06]--[2017-11-17 周五 13:15] =>  0:09
                    :END:
                    
                    
有关Torque会议的相关内容  有关Energy的文章
有关你的工作内容
** DONE [#B] [100%]舍友属性约减程序 <2017-11-17 周五 13:22>           :@office:
CLOSED: [2017-12-05 周二 12:10]
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-05 周二 12:10]
                    :LOGBOOK:
                    CLOCK: [2017-11-17 周五 13:22]--[2017-11-17 周五 13:23] =>  0:01
                    :END:                         
1. [X] 其师姐多样本程序
2. [X] 编写多属性程


Wind  turbines are getting bigger to extract more power from wind. The taller wind turbine structures
are more susceptible to different inflow events such as yaw inflow,elevation inflow,shear inflow,extreme gust,even 
much more complicated wind turbulence etc. With aerodynamic loading changes, wind turbine machine will 
response dynamically to capture efficiently wind energy. Namely, when wind direction changes, wind turbine will yaw;
When wind velocity become bigger, the blades will pitch. What's worse, the increase of stochastic inflow will exert 
additional push along different direction, so that the wind turbine tower will swag around,mainly from front to back.
The description of the wind turbine motion can be simplified into the multi-axis angular motion model, including the rotational
axis by wind rotor, the yaw axis by nacelle,pitch axis by blades,sway axis by tower etc.
The wind turbine multi-axis angular motion  are cyclic and reduce the life of the horizontal axis wind Turbine 
due to fatigue loading of the blades and other rotor components. Methods to accurately predict the accumulated damage caused 
by these loads are necessary to improve the design process. 

The objective of the present study is to evaluate the aerodynamic performance of the wind turbine for
different yaw inflow,especially high yaw angle case. The performance are evaluated by 


the dynamic response by yaw control  the result can be 
** DONE [#C] 领取开题报告查新报告并打印开题报告及文献综述 <2017-11-20 周一 22:36>
CLOSED: [2017-11-21 周二 16:42] SCHEDULED:<2017-11-20 周一>
- State "DONE"       from "TODO"          [2017-11-21 周二 16:42]
:LOGBOOK:
CLOCK: [2017-11-20 周一 22:36]--[2017-11-20 周一 22:37] =>  0:01
:END:
** DONE [#B] SPACECLaim前处理几何 <2017-11-21 周二 22:38>               :@work:
CLOSED: [2017-11-29 周三 00:23] SCHEDULED: <2017-11-21 周二>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-11-29 周三 00:23]
                    :LOGBOOK:
                    CLOCK: [2017-11-21 周二 22:38]--[2017-11-21 周二 22:39] =>  0:01
                    :END:
                    
                    
需要一些时间来磨合
** DONE [#A] 提交基金进展报告 <2017-12-01 周五 14:40>                   :@work:
CLOSED: [2018-01-09 周二 17:48] SCHEDULED: <2017-12-01 周五> DEADLINE: <2018-01-15 周一>
                    :PROPERTIES:
                    :Effort: 2:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-01-09 周二 17:48]
                    :LOGBOOK:
                    CLOCK: [2017-12-01 周五 14:40]--[2017-12-01 周五 14:41] =>  0:01
                    :END:
                    
                    
提前准备好

** CANCELED [#B] Learning English with Mrs xiao xinran <2017-12-05 周二 14:11 > :@home:
CLOSED: [2018-08-04 周六 23:09] SCHEDULED: <2017-12-05 周二>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "CANCELED"   from "TODO"          [2018-08-04 周六 23:09]
                    :LOGBOOK:
                    CLOCK: [2017-12-05 周二 14:12]--[2017-12-05 周二 14:12] =>  0:00
                    :END:
** TODO [#B] 去新街口珠宝大厦买砖石? <2017-12-05 周二 14:13>         :@work:
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-12-05 周二 14:13]--[2017-12-05 周二 14:13] =>  0:00
                    :END:
** DONE [#A] 流场可视化专利申请 <2017-12-06 周三 14:53>                 :@work:
CLOSED: [2018-05-29 周二 16:05] SCHEDULED: <2017-12-06 周三>
                    :PROPERTIES:
                    :Effort: 2:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-05-29 周二 16:05]
                    :LOGBOOK:
                    CLOCK: [2017-12-06 周三 14:53]--[2017-12-06 周三 14:54] =>  0:01
                    :END:
                    
                    
争取把它搞定
** CANCELED [#B] 本科校友聚会 <2017-12-07 周四 01:10>               :@NCEPU:
CLOSED: [2018-08-12 周日 20:00] DEADLINE: <2018-08-10 周五>
                    :PROPERTIES:
                    :Effort: 2:00
                    :END:
                    - State "CANCELED"   from "TODO"       [2018-08-12 周日 20:00]
                    :LOGBOOK:
                    CLOCK: [2017-12-09 周六 22:03]--[2017-12-09 周六 22:08] =>  0:05
                    CLOCK: [2017-12-07 周四 01:11]--[2017-12-08 周五 08:46] => 31:35
                    :END:
                    
[[https://www.baidu.com][hello]]                    
                    













































[[hello][内部]]
















sdf
** DONE [#B] 中央高校基金写作 <2017-12-08 周五 08:46>                   :@work:
CLOSED: [2017-12-11 周一 19:54]
                    :PROPERTIES:
                    :Effort: 2:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-12-11 周一 19:54]
                    :LOGBOOK:
                    CLOCK: [2017-12-08 周五 08:46]--[2017-12-09 周六 22:03] => 37:17
                    :END:
** DONE [#B] attengding xilei wedding <2018-01-01 周一 16:59>      :不紧急重要:
CLOSED: [2018-06-20 周三 11:06]
                    :PROPERTIES:
                    :Effort: 12:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-06-20 周三 11:06]
                    :LOGBOOK:
                    CLOCK: [2018-01-01 周一 16:59]--[2018-01-01 周一 17:00] =>  0:01
                    :END:
** DONE [#B] 14号火车票预定 <2018-01-10 周三 22:51>                     :@F708:
CLOSED: [2018-02-14 周三 00:03] SCHEDULED: <2018-02-14 周三>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-02-14 周三 00:03]
                    :LOGBOOK:
                    CLOCK: [2018-01-10 周三 22:51]--[2018-01-10 周三 22:51] =>  0:00
                    :END:
                    
回家的票（2张 欣然和我）
                    
** DONE [#B] 年后报增 <2018-01-26 周五 17:30>                           :@work:
CLOSED: [2018-04-09 周一 20:28] SCHEDULED: <2018-01-26 周五> DEADLINE: <2018-02-26 周一>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-04-09 周一 20:28]
                    :LOGBOOK:
                    CLOCK: [2018-01-26 周五 17:30]--[2018-01-26 周五 17:32] =>  0:02
                    :END:
                    
                    
李景涛签审签单

财务凭证得补齐（财务老师难搞定）

可能汇总表得修正（当前写着16000）
 
审签单也是16000，这和合同上的40000不符，但是合起来24000是40000，所以这个问题
得说清楚。[[*提交基金进展报告 <2017-12-01 周五 14:40>][提交基金进展报告 <2017-12-01 周五 14:40>]]
** DONE [#B] 如鹏提高docker <2018-01-30 周二 15:19>                     :@home:
CLOSED: [2018-04-20 周五 00:04] SCHEDULED: <2018-02-01 周四>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-04-20 周五 00:04]
                    :LOGBOOK:
                    CLOCK: [2018-01-30 周二 15:19]--[2018-01-30 周二 15:20] =>  0:01
                    :END:
                    
                    
take care!
http://www.rupeng.com/Activities/59.shtml

20:00--23:00
** DONE Todo [#B] java rupeng Improve <2018-01-30 周二 15:20>      :java:@F708:
CLOSED: [2018-06-20 周三 11:06]
                    :PROPERTIES:
                    :Effort: 6:00
                    :END:
                    - State "DONE"       from              [2018-06-20 周三 11:06]
                    :LOGBOOK:
                    CLOCK: [2018-01-30 周二 15:21]--[2018-01-30 周二 15:21] =>  0:00
                    :END:
                    
                    
http://www.rupeng.com/Activities/59.shtml

周六10:00-12:00
    14:00-18:00



    #+BEGIN_SRC python
      print “he”
    #+END_SRC
** DONE [#B] 提交文章初稿给王老师 <2018-02-04 周日 11:43> :@NCEPU:EnglishPaper:
CLOSED: [2018-04-09 周一 20:28] DEADLINE: <2018-02-14 周三> SCHEDULED: <2018-02-04 周日>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-04-09 周一 20:28]
                    :LOGBOOK:
                    CLOCK: [2018-06-20 周三 11:05]--[2018-06-20 周三 11:05] =>  0:00
                    CLOCK: [2018-02-04 周日 11:43]--[2018-02-04 周日 11:44] =>  0:01
                    :END:
                    
                    


** DONE [#B] Capture the Class name in project folder <2018-02-14 周三 12:11> :@Home:
CLOSED: [2018-02-14 周三 18:27]
:PROPERTIES:
:END:
- State "DONE"       from "TODO"          [2018-02-14 周三 18:27]
                    :PROPERTIES:
:

                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2018-02-14 周三 17:48]--[2018-02-14 周三 17:48] =>  0:00
                    CLOCK: [2018-02-14 周三 12:29]--[2018-02-14 周三 17:48] =>  5:19
                    CLOCK: [2018-02-14 周三 12:12]--[2018-02-14 周三 12:28] =>  0:16
                    :END:
                    
           ag支持正则表达式https://segmentfault.com/a/1190000011328038


                    #+BEGIN_SRC sh
                      G:\JavaBookmarks\hutool>ag "public\sclass\s\w*"
                    #+END_SRC
** CANCELED [#B] python matplot练习 <2018-03-01 周四 22:04>           :@NCEPU:学术:
CLOSED: [2018-06-20 周三 11:13] SCHEDULED: <2018-03-01 周四>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "CANCELED"   from "TODO"          [2018-06-20 周三 11:13]
                    :LOGBOOK:
                    CLOCK: [2018-03-01 周四 22:05]--[2018-03-01 周四 22:05] =>  0:00
                    :END:
                    
                    

                    [[p1]]
#+CAPTION: DAU统计  
|   日期 | 新增 | 日活 |    VV |             转化率 |
|--------+------+------+-------+--------------------|
|    <6> |      |      |       |                    |
|      / |    < |    > |       |                    |
| 2015-05-01 |   11 |   20 |  42.0 |                2.1 |
| 2015-05-04 |   12 |   20 |  41.0 |               2.05 |
| 2015-05-05 |   22 |   41 |  79.0 | 1.9268292682926829 |
| 2015-05-06 |   47 |   81 | 117.0 | 1.4444444444444444 |
|    All |   92 |  162 | 279.0 | 1.7222222222222223 |
#+TBLFM: @4$5='(/ $4 $3);N::@5$5='(/ $4 $3);N::@6$5='(/ $4 $3);N::@7$5='(/ $4 $3);N::@8$2='(+ @4$2..@-1$2);N::@8$3='(+ @4$3..@-1$3);N::@8$4='(+ @4$4..@-1$4);N::@8$5='(/ $4 $3);N

#+CAPTION: DAU统计  
|   |   | 日活 | VV |   |
|---+---+------+----+---|
|   |   |      |    |   |
|   |   |      |    |   |
|---+---+------+----+---|
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|---+---+------+----+---|
|   |   |      |    |   |
|---+---+------+----+---|
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
|   |   |      |    |   |
#+TBLFM: 

| df |   |   |   |
|----+---+---+---|
|  1 | 2 | 4 | 5 |
|  3 | 5 | 6 | 3 |
|  6 | 4 | 6 | 3 |

ta

** DONE 伟大的awk
CLOSED: [2018-06-27 周三 15:33]


- State "DONE"       from              [2018-06-27 周三 15:33]
#+BEGIN_SRC awk :dir M://fluentYaw30//

  ls *.cas|awk -F"-"  '{print a[NR]=substr($5,0,length($5)-8);}END{for(i=1;i<=NR-1;i++) print a[i+1]-a[i];}
                                                              '

#+END_SRC
** DONE [#B] 查阅energy投稿信息 <2018-05-23 周三 17:08>                  :学术:
CLOSED: [2018-06-27 周三 15:24] DEADLINE: <2018-05-29 周二>
                    :PROPERTIES:
                    :Effort: 0:30
                    :LAST_REPEAT: [2018-06-27 周三 15:24]
                    :END:
                    - State "DONE"       from "PENDING"    [2018-06-27 周三 15:24]
                    - State "DONE"       from "TODO"          [2018-06-27 周三 15:24]
                    :LOGBOOK:
                    CLOCK: [2018-06-20 周三 11:28]--[2018-06-20 周三 11:48] =>  0:20
                    CLOCK: [2018-05-16 周三 17:08]--[2018-05-16 周三 17:09] =>  0:01
                    :END:
                    
                    <2018-05-23 00:14> 已经处于under review状态【稿件处于审阅当中，直接分配到指定的审稿人】
                    
                    

                    
<2018-05-14 17:10> 投出去
<2018-06-21 15:24> sorry be rejected
** CANCELED [#B] 关注一下华能清能院的博士后工作站 <2018-05-25 周五 15:10>    :学术:
CLOSED: [2018-11-23 周五 18:11]
                    :PROPERTIES:
                    :Effort: 0:30
                    :LAST_REPEAT: [2018-11-23 周五 18:11]
                    :END:
                    :LOGBOOK:
                    - State "CANCELED"   from "PENDING"    T:[2018-11-23 周五 18:11]
                    - State "CANCELED"   from "TODO"          T:[2018-11-23 周五 18:11]
                    :END:
                    
                    
http://www.hnceri.com/n4/n12/index.html





#+NAME: lsttest
 - item: 星期五(address:华电)
   - item: 工作(method:computer,soft:cfx-matlab)
   - item: 开车(carry:驾驶证)
   - item: 技工(carry:身份证)
 - item:  星期六(address: 丰台, weather:cloud)
   - item:  吃饭(address: 金百万, person:father-mother)
   - item: 休息(address: 1104) 
   - item: 游玩(address:公园)
   - item: 爬山(address:八达岭, traffic:car)
   - item: 工作(soft:teamview)
 - item: 星期一
   - category (carry: umbrella)
   - item:  颐和园(traffic: subway)
   - item: 食物(food:bought)
   - item: 水(carry:bag)
   - item: 工作(soft:teamview)

#+NAME: src-example1
#+BEGIN_SRC elisp :results value :var lname="lsttest" :exports both
  (org-listcruncher-to-table lname)
  #+END_SRC

  #+RESULTS: src-example1
  | description | method   | soft       | address | carry  | person        | weather | traffic | food   |
  |-------------+----------+------------+---------+--------+---------------+---------+---------+--------|
  | 工作        | computer | cfx-matlab | 华电    |        |               |         |         |        |
  | 开车        |          |            | 华电    | 驾驶证 |               |         |         |        |
  | 技工        |          |            | 华电    | 身份证 |               |         |         |        |
  | 星期五      | computer | cfx-matlab | 华电    | 身份证 |               |         |         |        |
  | 吃饭        |          |            | 金百万  |        | father-mother | cloud   |         |        |
  | 休息        |          |            | 1104    |        |               | cloud   |         |        |
  | 游玩        |          |            | 公园    |        |               | cloud   |         |        |
  | 爬山        |          |            | 八达岭  |        |               | cloud   | car     |        |
  | 工作        |          | teamview   | 丰台    |        |               | cloud   |         |        |
  | 星期六      |          | teamview   | 八达岭  |        | father-mother | cloud   | car     |        |
  | 颐和园      |          |            |         |        |               |         | subway  |        |
  | 食物        |          |            |         |        |               |         |         | bought |
  | 水          |          |            |         | bag    |               |         |         |        |
  | 工作        |          | teamview   |         |        |               |         |         |        |
  | 星期一      |          | teamview   |         | bag    |               |         | subway  | bought |
** DONE [#B] Tourist <2018-06-12 周二 20:53>                             :芝麻:
CLOSED: [2018-06-27 周三 15:07] SCHEDULED: <2018-06-15 周五>
                    :PROPERTIES:
                    :Effort: 16:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-06-27 周三 15:07]
                    :LOGBOOK:
                    CLOCK: [2018-06-12 周二 20:53]--[2018-06-20 周三 11:02] => 182:09
                    :END:
                    
                    
北京->蓬莱
A计划
地铁10号线草桥A口集合，
0：00左右入住东营休息
6:00起来，出发早，早餐自理
9:00左右到蓬莱码头，购票等船上岛


B计划
地铁10号线草桥A口集合，
2：00左右入住东营休息
5:00起来，出发早，早餐自理
7:30左右到蓬莱码头，购票等船上岛

** ABORT [#A] DU300丝线实验(本科生创新实验) <2017-11-09 周四 17:53>  :@work:
CLOSED: [2018-09-29 周六 03:43] SCHEDULED: <2017-11-14 周二>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    - State "ABORT"      from "TODO"       T:[2018-09-29 周六 03:43]
                    :END:
                    - State "TODO"       from "TODO"          [2017-12-22 周五 10:39]
                    - State "TODO"       from "DONE"          [2017-12-22 周五 10:38]
                    - State "DONE"       from "TODO"          [2017-12-22 周五 10:38]
                      LIC算法改进
** DONE [#C] 取工程热物理发票 <2018-07-31 周二 16:05>               :@NCEPU:
CLOSED: [2018-08-12 周日 19:59] DEADLINE: <2018-08-08 周三>
                    :PROPERTIES:
                    :Effort: 0:30
                    :END:
                    - State "DONE"       from "TODO"       [2018-08-12 周日 19:59]
                    :LOGBOOK:
                    CLOCK: [2018-07-31 周二 16:06]--[2018-07-31 周二 16:06] =>  0:00
                    CLOCK: [2018-07-31 周二 16:05]--[2018-07-31 周二 16:06] =>  0:01
                    :END:
                    
一般挂号信 学校一个月之内退回

通过建行快速查找你的付款日期
** DONE [#C] 取邮局版面费 <2018-07-31 周二 16:06>                      :@NCEPU:
CLOSED: [2018-11-29 周四 16:21] DEADLINE: <2018-11-29 周四> SCHEDULED: <2018-10-02 周二>
                    :PROPERTIES:
                    :Effort: 0:30
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-11-29 周四 16:21]
                    - New deadline from "[2018-10-16 周二]" on T:[2018-10-22 周一 14:56] \\
                      ok
                    - New deadline from "[2018-10-08 周一]" on T:[2018-10-08 周一 15:39] \\
                      还未收到
                    - New deadline from "[2018-10-01 周一]" on T:[2018-10-03 周三 15:37] \\
                      重新规划
                    CLOCK: [2018-07-31 周二 16:06]--[2018-07-31 周二 16:06] =>  0:00
                    :END:
                    
                    一般3个月期限，比如0529== 0728过期!

                    82543103
                    

                    

** DONE [#C] 校医院取外敷药 <2018-07-31 周二 16:17>
CLOSED: [2018-08-01 周三 09:33] DEADLINE: <2018-08-01 周三> SCHEDULED:<2018-07-31 周二>
- State "DONE"       from "TODO"          [2018-08-01 周三 09:33]
:LOGBOOK:
CLOCK: [2018-08-01 周三 09:10]--[2018-08-01 周三 09:28] =>  0:18
CLOCK: [2018-07-31 周二 16:17]--[2018-07-31 周二 16:18] =>  0:01
:END:
** DONE [#A] 工程热物理投稿 <2018-08-13 周一 18:32>                 :@NCEPU:
CLOSED: [2018-08-14 周二 08:32] DEADLINE: <2018-08-14 周二>
                    :PROPERTIES:
                    :Effort: 0:30
                    :END:
                    - State "DONE"       from "TODO"          [2018-08-14 周二 08:32]
                    :LOGBOOK:
                    CLOCK: [2018-08-13 周一 18:32]--[2018-08-13 周一 18:32] =>  0:00
                    :END:
                    
                    
早上完成
** DONE [#B] 开始进行NREL5MW动态计算 <2018-08-14 周二 10:18>           :@NCEPU:
CLOSED: [2018-08-23 周四 18:52] SCHEDULED: <2018-08-14 周二>
                    :PROPERTIES:
                    :Effort: 16:00
                    :END:
                    - State "DONE"       from "DONE"          [2018-08-23 周四 19:27]
                    - State "DONE"       from "DONE"          [2018-08-23 周四 19:27]
                    - State "DONE"       from "TODO"          [2018-08-23 周四 18:52]
                    :LOGBOOK:
                    CLOCK: [2018-08-20 周一 11:04]--[2018-08-20 周一 11:04] =>  0:00
                    :END:
                    
                    
                   
希望快点!

静态计算也同时进行，分别在7号刀片和孟机器上
** DONE [#B] 2018论文版面费 <2018-09-07 周五 19:17>                    :@NCEPU:
CLOSED: [2018-09-19 周三 02:55] SCHEDULED: <2018-09-15 周六> DEADLINE: <2018-09-30 周日>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"          [2018-09-19 周三 02:55]
                    :LOGBOOK:
                    CLOCK: [2018-09-07 周五 19:17]--[2018-09-07 周五 19:18] =>  0:01
                    :END:
                    
                    

查看录用通知
** DONE [#B] 修改2018工程热物理录用全文 <2018-09-07 周五 19:18>     :@NCEPU:
CLOSED: [2018-09-16 周日 00:43] DEADLINE: <2018-09-15 周六>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"       [2018-09-16 周日 00:43]
                    :LOGBOOK:
                    CLOCK: [2018-09-07 周五 19:18]--[2018-09-07 周五 19:19] =>  0:01
                    :END:
                    
                    
必须完成
** CANCELED [#B] 办理借款  <2018-09-26 周三 16:30>   [100%]                :@NCEPU:
CLOSED: [2018-09-29 周六 03:42]  SCHEDULED: <2018-09-26 周三>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    - State "CANCELED"   from "ABORT"      T:[2018-10-08 周一 11:17]
                    - State "ABORT"      from "TODO"       T:[2018-09-29 周六 03:42] \\
                      通过公务卡还款
                    CLOCK: [2018-09-26 周三 16:30]--[2018-09-26 周三 16:30] =>  0:00
                    :END:
1. [X] 借款
2. [X] 注册费缴纳
3. [X] 火车票预定
4. [X] 酒店预订
** DONE [#B] 订火车票 <2018-10-04 周四 15:24>                            :学术:
CLOSED: [2018-10-08 周一 11:17] SCHEDULED: <2018-10-06 周六>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-10-08 周一 11:17]
                    CLOCK: [2018-10-04 周四 15:25]--[2018-10-04 周四 15:25] =>  0:00
                    :END:
                    
                    


                    I think 
** CANCELED [#B] 参加风能展览 <2018-10-08 周一 15:42>                        :学术:
CLOSED: [2018-10-16 周二 11:11] SCHEDULED: <2018-10-17 周三>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    - State "CANCELED"   from "TODO"          T:[2018-10-16 周二 11:11]
                    CLOCK: [2018-10-08 周一 15:42]--[2018-10-08 周一 15:42] =>  0:00
                    :END:
                    
                    
                    
10-17~19
** DONE [#B] 学习Excel <2018-10-08 周一 17:09 >                          :学术:
CLOSED: [2018-10-20 周六 21:29] DEADLINE: <2018-10-20 周六>
                    :PROPERTIES:
                    :Effort: 1:00
                    :ORDERED:  t
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-10-20 周六 21:29]
                    CLOCK: [2018-10-08 周一 17:09]--[2018-10-08 周一 17:14] =>  0:05
                    :END:
                    
                    
***  1. Formulas
***  2. VLOOKUP & INDEX
了解过
***  3. PivotTables
(已经会了，很方便做数据分析，特别是不同区域的销售记录)
***  4. Recorded Macros
:LOGBOOK:
CLOCK: [2018-10-08 周一 19:42]--[2018-10-08 周一 19:51] =>  0:09
- Clocked out on T:[2018-10-08 周一 19:51] \\
  理解macro只是键盘宏
:END:
不熟悉，没怎么用过哦

Ctrl+shift+->   选择到右边
ctrl+shift+down 向下选择

Ctrl+A 和Ctrl+*类似

ctrl+1 定制选择区域的格式

转置录制键盘
***  5. Charts
:LOGBOOK:
CLOCK: [2018-10-08 周一 19:51]--[2018-10-08 周一 22:29] =>  2:38
- Clocked out on T:[2018-10-08 周一 22:29] \\
  Alt+F11 and F11
CLOCK: [2018-10-08 周一 19:26]--[2018-10-08 周一 19:42] =>  0:16
- Clocked out on T:[2018-10-08 周一 19:42] \\
  bye
:END:
作图会


Alt+f11 柱状图
F11 new sheet shows colume figure.

selection, ctrl 1 to format the region your selected

save as template, save as default


Date type selected---->Customize number format(ctrl 1)

***  6. Keyboards

https://people.highline.edu/mgirvin/excelisfun.htm

https://www.youtube.com/watch?v=kNaxTNSAtLk

Detailed and easy_understanding instruction

Ctrl+backspace----> 类似于ctrl c w,定位，或者mark没方便调回来
Ctrl+down---> jump to the down of table till the empty cell
ctrl+left -->  jump horizontal
highlight 2--> ctrl+shift+down  hightlight all the table
Editing-->填充----series----自动填充一个序列，类似于linux的seq

*** 2017版本
:LOGBOOK:
CLOCK: [2018-10-08 周一 22:30]--[2018-10-09 周二 00:00] =>  1:30
- Clocked out on T:[2018-10-09 周二 00:00] \\
  完成2017第一节学习
:END:
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2018-10-09 周二 12:43]
| Headline   | Time  |
|------------+-------|
| *Total time* | *14:10* |
|------------+-------|
#+END:

https://www.youtube.com/watch?v=RsDFonVtKGM

F4--在公式中改变为绝对左坐标
F4两次列固定，行不固定
F4三次行固定，列不固定(一个妙用，根据某列hightlight整行 formatline --> 新建规则=$E10="X")
F2 显示公式

=vloopup(查找词，词典，第几列值，false精确查找)


在学习excel的过程中也让我想起了emacs、awk、linux bash语言


flash fill适合格式化数据


**** power query
:LOGBOOK:
CLOCK: [2018-10-09 周二 00:00]--[2018-10-09 周二 12:40] => 12:40
- Clocked out on T:[2018-10-09 周二 12:40] \\
  Dark blue with white fonts make reader easy reading
:END:

ctrl+Enter: put thing in cell and keep cell selected
shift+Enter: put thing in cell and move cell selected up
Enter: put thing in cell and   selecte cell down
tab: put thing in cell and   selecte cell right
shift tab: put thing in cell and   selecte cell left


1. 准备一个文件夹
2. Data--查询---from 文件夹----> 然后新建一个，在binary文件内容字段有一个下拉两箭头进行设置接口
3. 
*****  Data analysis and business intelligence

Data analysis : Convert Raw data into useful info for decision makers(DM)
Business intelligence: conver Raw datza into useful/Actionable info for DM in a business situation

1. Raw data
2. clean data
3. tranform data
4. report: goal of data analysis and business intelligence
   create usefule,updateable,actionable info for decision makers

   
***** the schools of Thought for stylistic formating:

i. Field names or column headers should be bold.(Bold)
ii. Use Number Formatting sparingly.(sparinly)
iii. Don’t use alignment.
iv. The default gray lines in the spreadsheet are the only borders you need.
v. Sometimes red is used to indicate importance(Color)
ii. Font Color and Fill Color must have a large value difference so that it is easy to read:(学到了一招，很有用)
    1. Dark Blue Fill Color and White Font Color have a large value difference.
    2. Red Fill Color and Black Font Color do NOT have a large value difference.

**** what excel does?

1. Make calculations---numeric ,locical and text calculations
2. Data analysis--->Convert raw data into useful info for decision makers

   sumifs, countifs, maxifs,minifs,averageifs
   
都是类似于vlookpup函数的风格，第一个区间是要进行计算的数据，
后面是选择的标准，根据标准选择数据进行计算，定位数据。

=SUMIFS(E1:E17,">=100")  某列大于100

类似于，下面对满足条件的进行求职
=SUMIF(E1:E17,">=100")
VLOOKUP: =VLOOKUP( lookup_value , table_array , col_index_num , [range_lookup] )
多条件求和函数、数数函数


criteria argument contains the condition or criteria that tells the function what to count.
1. Conditions and criteria can be:
    i. Text (like “West”).
    ii. Numbers: numbers, Dates, Times.
    iii. Logical values (TRUE or FALSE).
    iv. Numbers (or Text) with comparative operators:
        1. Example: >=1000 can be used as criteria
            i. You can type >=1000 in a cell and refer to it in formula
            with cell reference.
            or
            ii. You can type 1000 in cell and join the comparative
                operator to the cell reference that points to the number
               like: “>=”&F30, where:
                1. Number is in cell F30 (for this example)
                2. Comparative operator must be in double quotes
2. You can enter up to 126 range/criteria pairs
   

一定要回想countifs(区域，条件，区域，条件,...) 一定要注意行数必须一致才可以
不能有单元格合并的情况，否则报错
                    
                    
** DONE [#B] 车管所换证 <2018-10-20 周六 15:27>                     :@NCEPU:
CLOSED: [2018-10-21 周日 18:10] DEADLINE: <2018-10-21 周日>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-10-21 周日 18:10]
                    CLOCK: [2018-10-20 周六 15:27]--[2018-10-20 周六 15:28] =>  0:01
                    :END:
                    
                    
明天过去换证
1、车辆管理所京北分所
地址：北京市昌平区马池口镇马池口村北方检测场旁

** DONE [#B] 摩托车驾照考试科目一 <2018-11-04 周日 16:58>           :@NCEPU:
CLOSED: [2018-11-09 周五 22:31] DEADLINE: <2018-11-09 周五>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-11-09 周五 22:31]
                    CLOCK: [2018-11-04 周日 16:59]--[2018-11-04 周日 16:59] =>  0:00
                    - Clocked out on T:[2018-11-04 周日 16:59]
                    :END:
                    
                    

下午考试                  
** TODO [#B] 李涛PS高手进阶之路 <2018-11-07 周三 20:21>             :@NCEPU:
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2018-11-11 周日 14:06]--[2018-11-11 周日 14:26] =>  0:20
                    - Clocked out on T:[2018-11-11 周日 14:26] \\
                      通道
                    CLOCK: [2018-11-10 周六 16:06]--[2018-11-11 周日 09:50] => 17:44
                    - Clocked out on T:[2018-11-11 周日 09:50] \\
                      画笔很重要，纹理画笔得掌握
                    CLOCK: [2018-11-08 周四 09:27]--[2018-11-08 周四 13:10] =>  3:43
                    - Clocked out on T:[2018-11-08 周四 13:10] \\
                      带着感知的简单化
                    CLOCK: [2018-11-07 周三 20:21]--[2018-11-07 周三 21:54] =>  1:33
                    :END:
                    
                    
                    
重新再学一下光和影

从他的口中学到了  "画笔就是PS的代言"

我也知道了动作记录，可以批量处理，知道了曲线调节，还需要再学其他？ 

蚂蚁线少用，只用画笔

图层是一张透明玻璃纸(最后合成出来)

1. 细节对于你画风的影响
2. 美术的风格
3. 画面的美感
4. 改变你的思考风格
5. 培养生活的洞察力
   

会了基本的技能，还想要干什么？ 知道自己已经能够批量干活，还需要继续学习?
学习当时你没学会，并且重要的部分？

PS二维图像的合成软件（合成就是艺术素材再加工，再处理),定位是合成!

Illustrator，painter适合创造


1. 颜色、分辨率、图层、光
   颜色有三个属性: 色相(hue赤橙蓝绿。。),饱和度(saturation,也叫纯度，提现鲜艳程度)，亮度(bright)----一种色彩模式
   黑白没有色相，其实饱和度是和白有关（还是和黑有关)，亮度是和黑有关(和白有关)。
   (每一种模式对应一种媒介,HSB指的是人眼媒介,就是你看到的) 还有比如RGB(光色三颜色，颜料中使用,
    显示器(晶体管只发三种光，[0-256],[0-256],[0-256],1678w种颜色， 投影仪),
   CMYK(打印媒介)

加色模式（三种颜色加起来变成白色，叫做加色过程)
128,128,128    50,50,50   200,200,200 无色相，色相越低深灰，色相越高浅灰

发光物体：不通过别的物体折射能看到，自身产生光
书，不是发光物体，他需要光照射（光和色是很有关系的，很有意思的）

光的三颜色， 色也有三颜色(C，青 M 品或洋红色, Y黄，黑色用(0,0,0,100) K代表黑色）,油墨三颜色

RGB两两加色变成青品黄(RB组合成品，RG组成黄，GB组成青
RGB是加色模式（三个相加为白色)
青品黄是减色模式(三个相加为黑色)
青色可以完全吸收红色！！！（完全变黑)

很重要原理: R在12点钟方向，G在4点钟方向(10点钟的品)，B在8点钟方向，青在6点钟方向(刚好和R处于对角线)，品在10点钟方向, 黄在2点钟方向。
在时钟方向上，对角线上的光相互吸收（没有任何效果的)
这就是光色的原理！

what is color? light.color,  object.color, light is also an object?


树为什么是绿的，因为只有绿色光反射到你的眼睛！
你看到什么，是因为有些被吸收，有些被反射，反射回来叫做你看到的光
2. 分辨率

色域问题，大自然数以亿计，整个ps的合成过程只不过是再现大自然的颜色（数值仿真，肯定有存在无法表达的过程)

光的色彩描述和色的色彩描述是不一样，因为色需要媒介转化过程，光有时候只能看到，但是不能印出来，因为存在溢色
在印刷时候无法表现出来（色的计算机表达还存在缺陷）

工作中的CMYK表示通过CMYK进行预览，（打开的时候使用RGB方式,屏幕颜色, 颜色识别器感叹号表示打印时颜色看不到
打印不出来）

啥时候显示器能够和印刷时候做得一致。


2. 分辨率
   分辨率是什么？ PS位图，基于像素的(叫做图像，归于像素)，矢量是基于路径的(比如Illustration，叫做图形)
   通过像素来表现一张图，一个像素一定是正方形，一个像素一种颜色(越来越多像素构成更多细节),图片分辨率一般是
   72ppi( ppi pixel per inch（还有每厘米),   dpi dot per inch,  印刷dpi 墨点每英寸)
   72ppi: 对应平方英寸就是72*72=5184
   印刷必须是300ppi(300*300=90000 每平方英寸得挤上90000个像素，更精细和细节)
   
   3. 打开一张图需要干的事情
  颜色---尺寸----分辨率（必须在开始时候创建300ppi)
RGB颜色模式----对应尺寸10*10----72ppi ---->针对网页(不能直接通过--图像大小--》从72到300的改变，数据量会变大，通过算法生成额外捏造出来)
        一定注意不能通过图像大小来改变分辨率，画面会被撑得很大，显示器分辨率没变（还是72），但是此时图片300分辨率，显示器得放大
        4倍才能显示你的整个画面，这是有问题的。重定图像像素---的算法有邻近，两次立方，两次线性，两次立方(较平滑),两次立方(较锐利)
        复制旁边颜色来实现。
RGB颜色模式----对应尺寸10.6*10.6（印刷留3cm)----300ppi ---->针对印刷(工作中的CMYK,进行预览)

也许到某天图像放大缩小不会损失（算法逼真算法，有吗？小图放大，更逼真，太难实现)


3. 艺术，让人脱颖而出
   发现、联系、重组（发现很重要，联系也重要，最后得重组)

   王阳明有一句话:" 你未看此花时，此花与汝同归于寂；你来看此花时，则此花颜色一时明白起来"
     口语：”有一段花开了，你没看他时，就好像她没开；你看它时，那么花瞬时在你眼前明亮起来“,要用艺术的眼光欣赏

摄影太难，难就难在太简单了（能不能找到最简单的一面, 难和简单!)----简单是复杂的重复，复杂丰富简单
(复杂是简单的重复，不对, 只有通过不断地重复复杂，才能获得简单)不要停留在复杂层面,进不去。
只要抓住本质就都很简单？？ 跳到根上.


拍摄是谱曲，后期是演奏.(后期，合成)

预想法：最终后面， 分成两个部分，拍摄和演奏。
拍摄是谱曲，后期是演译.(后期，合成. 后期是在讲故事， 贝多芬谱曲，马友友拉出来)



内外兼修: 内和外是什么关系? 要看到背后的秩序
-----井然有序------

心游于艺，道不远人(艺道，不是艺技)----
孔子: 志于道，据于德，依于仁，游于艺（倒过来看)

日本花道（东土大唐学来）  茶道(喝茶喝出来, 气.. 武士道   弓道 -----道乃本质

4. 学习方法
   发现、联系(第二点, 建立联系想象力就产生了)、重组

   立意要高(整体学习过程，比较高的角度进行思考，这样才能持续经久)
         取法乎上，寻师经典(找到领域、体系、行业顶尖的大师,最牛的学生，最好的书) ,求其上，得其中，求其中，得其下，求其下，则败；
         务先大体，鉴必穷源（深入学习)
         诚心正意，自证良知(正，证，验证才能和你有关系, 自己证明, 知行合一)
   问题要深(引入发现、联系、重组)
         问问题的过程要深入(最有问题的地方，大家不会问问题)
         问问题的思路不对，深入这个体系去问（通过百度能解决，能通过深入思考解决的，不要问）
         好作品？ 形式美和内涵  好看和有意义   打动人心（外内兼修)   赏心悦目（两个层次：内和外)
         1. 天下大事，必做于细（细）（细化和深入，不要往琐碎的细节去思考，而时细化和深入)------发现
         2. 众生平等，皆有联系(联） （终生，一花一草一木皆平等，环环相扣，联系不能过去浅显，潜在的联系，隐含的联系，精神层面的联系
            发现到联系
         3. 情理之中，意料之外(组）（重组，不一样的地方，符合逻辑又超出逻辑,这样才能脱颖而出,尝试变化）
            斑马、钢琴线的联系，重组
            发现是3点钟（观察力)，联系是6点钟(想象力)， 重组是9点钟(创造力)
            

1. 好的艺术家，抄
2. 牛逼的艺术家(你发现了斑马的细节，钢琴键的细节，然后你尝试联系他们,进行想象)，偷，偷学了一个灵感转化为自己的灵感

   持续要久
        久的概念， 人生诞生的目的是：继承学习（继承前人的经验)


通过复利的概念引入久的概念，通过10万做基准，按照不同复利计算，可以看出35年之后的增长后的价钱是不同的，
你的复合利率越大，曲线越陡峭，也就是你的价值越高，但是前十年都不高，
1. 只有经过了频谱过渡阶段
2. 速度足够大，轨道转变（天体力学)----只有你达到一定的速度，并且能够持续，你才能进行变轨(一定的速度，一定的时间)
3. 进入超光速和超频率阶段
   当达到一定的技术高度时候，时间和空间不是问题？？？？
   电子轨道，原子轨道量子变频，电子跳频，阶跃，因为一定的速度代表一定的能量。（功率大部分是和当时的速度有关的）
电子轨道分为能层和能级。能层就是原子核外的电子层排布，而能级又是根据同一能层中不同电子所具有的能量不同所划分的，
分别是s,p,d,f……等。主族元素是没有d、f层的，只有副族元素有，而且副族元素也有s、p等轨道。当原子失去电子的时候，
先失去最外层的s、p轨道上的电子，所以主族元素的化合价=该元素的族序数；而副族元素有时还要失去d、f层上的电子，故副族元素有多个化合价。
能量越低、越稳定！

Adams： 我们不只是用相机拍照，我们带到摄影中去的是所有我们读过的书、看过的电影
        听过的音乐、走过的路、爱过的人。（牛逼）----你的经历决定你的高度，拍你的经历，你的个人见解。(由此引入久的概念)
        
  涉猎要广。
  

演绎。前期谱曲
     后期ppt演讲
     

歌曲改变人生/一切从音乐再开始(港)/纽约小情歌][Begin.Again.2013.Bluray.iPad.720p.x264.AAC-BYRPAD]
   : 发现联系重组（男主人公发现了女主人公 ，女主人公被）
   穿越苍穹
   
"摄影师采集生活影像、传达直观信息的一种视觉艺术。摄影的表现对象是是觉得，摄影作品是形态的
也是视觉的。但在拍摄创作活动中，摄影家对艺术感受的捕捉，对生活的认识和对立意、创意的表达，
却不能仅仅依靠视觉，这是因为，人们对世界的认识，是通过多种感官完成的----索久林《摄影创作的翅膀---走进摄影艺术通感》

了解你从事的东西的背景（仓鼠，重复的工作）, 要跳出你的圈子，进入到速度曲线内(能把你弹出去）。

[[file:~/.emacs.d/README.md][readme]]
Remember there are no hard and fast rules here. It’s your Brain. 
However, there are some basic information architecture principles that should be followed 
when organizing information sets. 
1. Things that are a part of a group should all be together below as Child Thoughts.(组合的思想)
2. Things that define a group should be above as Parent Thoughts. 
3. Things that are related but not part of the main group should be linked on the left as Jump Thoughts.(联想）

*** 穿越苍穹
 https://v.qq.com/x/cover/0p0e0dhv8v1non9.html?ptag=baidu.aladdin.movie

 let it be!

 

修复画笔工具，仿制图章工具，都是用来修照片（原理类似), 但是修复画笔有一个好处是可以自动过渡，
过渡比较均匀。


选择很重要，蚂蚁线不重要。选区很重要(如何新建，局部修饰，局部保护)
画笔的背后模式，是指你每画一笔，新绘制的曲线都会在背后，而不是修改之前的，
1. 必须存在透明区域（也就是无像素区域），因为背后画笔只会绘制在像素之后
   有像素在前则看不到你的绘制效果
   
   均以前景色为基准^-^
画笔的变暗模式，是指你的画笔以前景色为基准，所有比前景色亮的，都变为前景色
所有比前景色暗的都不发生变化（暗的不变化，一种颜色来评调)


画笔的变亮模式，是指你的画笔以前景色为基准，所有比前景色暗的，都变为前景色(变亮)
所有比前景色亮的都不发生变化（暗的不变化，一种颜色来评调)

可以用于嘴唇的颜色绘制^
滤色(加色模式---变白  变亮  可以瞬间去除黑颜色)
正面叠底--减色模式（变黑--变暗)


画笔的模式分为色的模式和光的模式两种类型(光就涉及到大卫模式了，C色吸收红色光)
光中的叠加（越画越浓)
柔光屏蔽中性灰(不清楚）


差值和排除都是得到像素负片的效果（做局部修饰)


我们遇到ps不能自定义图案，可以从下面几点找原因。

　　自定义图案对形状有严格要求，只能是矩形选框工具绘制的不带羽化值的选区，才能进行定义图案。比如椭圆选框工具是不可以的。

　　1.使用矩形选框工具的时候将羽化值改为零。(的确得是矩形

　　2.ps自定义图案的形状是方正的，如果想用一些不规则的图形作为图案填充，周围区域保存保持透明，也就是图案不透明，而其余背景改为透明。

　　3.如果当前的层上有路径并且处于激活状态，那么ps也不能自定义图案，必须将路径删除或隐藏不激活，才可以进行定义图案

图案也可以在浮雕中的图案进行，！


**** 纹理画笔
从笔画的最小基元开始思考。。。

F5，选好画笔的形状，大小，方向，【动态（大小抖动，角度抖动—），散步（打开），平滑，  编辑--->动画预设】
间距要足够大！（让雨点、雪点、气泡点分开
可以做成多层（冰做成高斯模糊，远的虚点，近的时点，不断叠加层数，甚至加上透明度） 虚实、清淡变化
动感模糊--也可以增加）

画笔本身就是黑白相间（灰色中间色）
从小做大，不断（画笔大小快捷键，
Alt+鼠标右键左右拖动改变大小，
Alt+鼠标右键上下拖动改变硬度


用柔性笔（初始笔刷，比较小，然后绕着一圈做一个小圈，绕着蚂蚁线周边绘制，舔着画，虚化，）
然后用滤镜---模糊---高斯模糊（2.4ppt半径模糊即可）


有光线必须有阴影（一般做到2层到3层以上,比较逼真）---先把人形复制出来，然后变化角度，透视，放在一定的角度
即可，然后用滤镜的高斯模糊（两层，三层都需要模糊，越多层，越模糊）

画笔本身状态是例子状态（雨雪、毛发、草等）----创建自定义的纹理画笔
**** 调色
***** 色阶


Ctrl+L  输入侧调节黑色和白色场，或者直接用黑色吸管设置黑场，白色吸管设置白场,
自动有时候不准，可以试试。
还有一个灰色吸管，是最重要的！输入色阶中的中间值是ganma值，灰度值变化。

通道是记录颜色信息的（单通道调节来实现)

Ctrl+shift+L自动色阶，适用所有图片！！！！色阶自动拉开，自动对比度不需要使用
***** 曲线


CTRL+M 一般设置两层
1. 亮的曲线层(中间亮，局部凸显)
2. 暗的曲线层(四周暗)

直线往上变量(上弦线,因为往白色区域变多)，往下变暗(下弦线,因为往黑色区域变多)

s弦线代表对比度，黑的地方更黑，亮的地方更亮（要知道哪边是黑的区域，哪边是亮的区域）

***** 色相、饱和度


CTRL+U 单单选择颜色通道，比如蓝空变成橙色。。
比如用吸管进行吸附，对某些颜色进行单纯控制

在颜色条中存在输入输出条，下面的灰色4个标色块，代表输入区域（存在颜色容差值)

***** 色彩平衡


1. 阴影(黑色区域)
2. 中间调(物体本身颜色, 通过他调节冷暖颜色，往冷色调进行)
3. 高光(亮色区域）
4. 投影(没有)
5. 明暗交界线(没有)
   
***** 匹配颜色


对已有的素材进行艺术再加工
匹配--通过两张照片进行匹色（大师的光源，匹配白天和黑夜）---放开思路

***** 图层

图层，一张图一个层，甚至多个层，像一层薄薄的玻璃纸，透明的

****** 图层蒙版 
复制一张图片，选择两一张图的某一个选区，然后编辑---选择性黏贴(贴入)

实际上图层蒙版只是在通道中行成一个选区，alpha通道，用来控制图层的显示范围。

好处是可以移动，而不是类似擦除的效果，擦完不好再现。图层蒙版适合反复修改（复制图层不太好的地方
会破坏原始图层，图层蒙版不是通过橡皮擦，而是通过遮挡，魔术大师再现了。

图层--图层蒙版：会产生一个显示全部或者隐藏全部的命令，显示全部则感觉蒙版没效果，因为此时没有
遮罩的效果，黑社会只要三种颜色，白色不遮罩，黑色则全遮罩，灰色半遮罩


****** 混合颜色带


混合颜色带，包含本图层和下一图层，
本图层和下一图层都包含从黑色到白色的区域（黑色代表一张图的
暗部区域，白色代表颜色的两部区域)

如果在本图层，两个带之间代表保留区域，黑往前移动代表黑色被遮盖
被下一图层遮盖，下一图层就会透出来，

同理在下一图层。相互选择，相互遮盖!

一定要把容差值用好（通过Alt+鼠标左键点击，可以把箭头一拆为2，这样就可以过渡更加perfect)

****** 图层混合高级混合

挖空--深，直接挖到背景，浅

注意要把其中一个图层转化为背景图层，否则默认背景图层是方格（或者为空)

可以点击下方的视频轴，创建视频轴，转化为帧动画，然后创建第一帧和最后一针，最后通过过渡帧，平滑过渡。

最后回到转化为视频时间轴，渲染动画即可

常规混合----颜色带混合-----高级混合(挖空)


投影----品质----等高线（类似曲线调节，可以绘制曲线，代表亮暗区域）
滤色（滤掉黑颜色，加色模式） 正片叠底（滤掉白颜色，减色模式)


浮雕---变厚的效果----纹理----图案（做阴影有用）

图层----图层样式---创建图层（可以把每一个样式创建一个图层，然后可以用CTRL+T 进行图层变形,透视，比如阴影变形，通过高斯模糊过渡）

(为什么？ 类似于把样式抽离出来建立一个图层？！）

图层---新建填充图层---纯色、渐变、图案图层(很方便，相当于建立了一个蒙版）
    ---新建调整图层---色阶、曲线、色调、饱和度\反向、(不改变原有色片、跟蒙版的效果一样
       不破坏原始素材！所以在图层蒙版中也有类似蒙版和调整图层的按钮）
       使用前一图层创建剪贴模板（不针对背景了,被编辑的图层会显示下划线，控制的图层会多出一个向下箭头)
       快捷功能就是图层-创建剪贴蒙版（Alt+鼠标会出现编组图标）----大往小的贴图。
       若干个图扔到一个小的路径中（让图层间存在联系）
       
 锁定----图层锁定就是说锁定当前图层，比如一个图层只有画笔，其他均为透明，要是换颜色很简单，锁定，然后画笔随便画，
不回透出去。

妈的，真棒，裁切，先随意弄一个矩形选区，然后把中心移到顶角，旋转，然后在拉动就正确裁切了
****** 图层组

****** 滤镜


抽出----很方便！抽出背景来
对于各位使用PS来处理图像的用户而言，其滤镜抽出功能提供了更加直观的抠图理念，
但最新版本的PS删除了抽出功能，对此我们该怎么使用抽出功能呢
cs5以上版本就移除 抽出滤镜了，融合到：调整边缘命令。（注; cc2017版本 翻译为：选择并遮住
也是挺方便的，类似蒙版

消失点透镜很好玩（近大远小）---滤镜---消失点--创建一个平面--然后用工具中的仿制图章命令（很厉害的
透视工具）----这样也可以方便透视黏贴，透视删除，自然删除。。。游戏大场景铺设，根据颜色变化未变化） 有透视的地方
均可以用到。（按照路径进行透视)

滤镜--像素画--彩色半调(变成灰度，在进行彩色半调）
    --像素画--马赛克
   
滤镜---扭曲--极坐标(地球仪,包起来的)---平面坐标（地图 ,展开的)
             用于爆炸效果
   ----扭曲--置换---特别好用，三维贴图(先保存一张山的纹理，水的纹理等psd文件，然后置换的时候选择该文件，在ps里面在进行混合即可
   ----扭曲--镜头校正
   
滤镜----杂色---减色杂色（
           ---添加杂色（胶片感，需要添加杂色)

滤镜--- 模糊---特殊模糊（广告--模糊--丝绸般柔滑）---缺点不模糊轮廓（用历史画笔修复一下）
   ===== 用表面模糊替代特殊模糊（专门用于做皮肤处理)

滤镜---锐化（一定要锐化，强化效果，表达清楚，越清楚，

四个步骤
1. 自动色阶---
2. 加饱和度(30度左右)---
3. 冷的更冷--暖的更暖（色彩平衡，中间调物体本色不变化，阴影调得冷些，高光调的暖点),产生周围环境的感觉(凸出环境)
   阴影，(-5 ,0,10)    高光(10,0,20) 
4. 加锐化(整体不管，只留边缘, 轮廓线提出来最好的锐化)---先进性高反差保留(复制当前图层，然后高反差保留，柔光复合
  (轮廓线1个像素即可),柔光可以屏蔽掉灰色，很有用
   复制层级则可以继续锐化----多层玻璃纸逐渐锐化（复制几层效果更好)

  
photomerge--批处理--如果衔接照片颜色不匹配，直接颜色匹配一下(match color）


****** 红外线

如何体现一张照片的色温

1. 新建一张红色图层
2. 采用明度混合图层
3. 观察这个色板（这就是你的图片的监测器，检测器，监测器）
4. 紧接着你就可以创建图层调整蒙版---然后按住Alt-鼠标左键，关联到下一图层，只做到下一图层，不影响其他交通。
   这样 你就可以反复调节色彩平衡！！wow很棒！让你的人接近背景色，与环境搭调！

暖色光源漫反射到主体的能量要合理，不能出现跳跃，要连续。---中间调、高光、阴影都得进行调节。
一定要进行阴影匹配（水平翻转)------可选颜色是色彩平衡的细节化（色彩平衡针对大体，两者类似，可选颜色会使得肤色更好些）
可选颜色有必要的。

要体现物体前后，只要使用遮罩功能即可


当然可以试试其他混合方案--比如颜色加深---高光过了。。-可以再增加一个色阶--把输出的量值降一些。

调色分为两个部分
第一校色，第二调色

校色，准确还原(红外线)
    5个环节,反复比较
    1. 正确的黑白场(黑的够黑、白的够黑)
    2. 准确的色彩还原
    3. 层次（丰富且合理的层次，灰度，过渡舒服)
    4. 足够的清晰度(锐化，高反差保留)
    5. 适当的饱和度(20-30 很鲜艳,不要很灰)
调色，是升华


****** 曝光


当突然曝光出现颜色（则表示车不多了，太多的白色就是曝光过渡)

***** 通道

通道，通往哪里？

后台做事，记录颜色信息（最基本用途),颜色通道
更细点：凭什么记录颜色信息，依赖什么记录颜色信息?
RGB(0-255)---2^10=256 ,二进制通道，二是一把钥匙

PS是8位位深度处理软件，2^8=256颜色，每个通道有256个可表达的位置
通道只有黑白灰三个颜色（黑西装，白衬衣，打灰领带，所以通道是黑社会分子)

（物理量是光的强度，越亮该值越大)
红色通道代表红灯泡，越亮代表红色通道值越大，越暗代表红色通道值越小
蓝色通道代表蓝灯泡，越亮代表蓝色通道值越大，越暗代表蓝色通道值越小
绿色通道代表绿灯泡，越亮代表绿色通道值越大，越暗代表绿色通道值越小

通道值的复合就变成我们看到的颜色。


如果改为图像---》模式---》CMYK, 则是油墨模式，（物理量是油墨量，越黑油墨喷得越多)

越黑的地方喷的越多（刚好跟RGB光色相反，越黑的地方对应杨红、黄色、青色油墨量越多),
按照100%的喷，则是显示全黑。


x切换前景色和背景色（对于图层蒙版的画笔绘制特别方便）
v代表移动
m代表选择


图层蒙版是最好的用于控制两张图片混合，合成（图层菜单，添加蒙版，点击蒙版区域（四边会出现四角，表示选中状态)
然后快速遮罩)-----然后配合上渐变，染渐变显示。。。


****** 专色


大金色得用专用油墨来印刷，烫金、烫银!
黑也是一种专色，专色的红版和绿板都可以。

也记录着黑白灰的值(色彩信息值)（按照对应的专色油墨进行喷涂即可)

****** 选区通道(alpha通道)

ctrl+D去掉选区， 蚂蚁线选择一个区域--保存选区，存储为一个选区通道。
此时通道就是用来记录选择信息（而不是颜色通道的颜色信息)
黑色代表不选择地方，白色代表选择区域。（黑颜色相当于一种遮挡，遮罩，不让人看到)
ctrl+缩略图，即可调用选区（也可以通过载入选区)


羽化选区(shift+F6)，羽化半径15，以蚂蚁线为准，存在+-15淡入淡出(向内15淡入，向外15淡出)
此时选区通道就记录了三种颜色(没羽化就是黑白两种颜色)


psd格式、tja(targa 视频)、tif格式支持alpha通道，其他不支持
JPEG支持路径，但是不支持alpha通道

8*3 24 RGB
8*4 32 RGB+alpha(透明区域),alpha通道如果保存24则该通道被删除


很有意思的复制，
比你通过通道选区，复制红、蓝、绿三个通道，得到三个副本
然后在新的照片中，新建三个图层，
在照片中，通道面板中，点击红色通道(ctrl+鼠标左键），选择上红色区域选区(红色色彩信息区域)，
在照片中，图层面板中，点击图层1，选择前景色，[255,0,0],Alt+delete填充,植入红色

在照片中，通道面板中，点击蓝色通道(ctrl+鼠标左键），选择上蓝色区域选区(蓝色色彩信息区域)，
在照片中，图层面板中，点击图层1，选择前景色，[0,255,0],Alt+delete填充,植入蓝色

在照片中，通道面板中，点击绿色通道(ctrl+鼠标左键），选择上绿色区域选区(绿色色彩信息区域)，
在照片中，图层面板中，点击图层1，选择前景色，[0,0,255],Alt+delete填充,植入绿色

最后通过滤色混合图层模式，进行加色,CTRL+E合并图层


通道还原选区(通道记录颜色信息），通过颜色信息确定选区,

****** 通道用于抠像
绝大多数时候，通道被用于抠图、去背扥

分为三种情况，1.清晰和复杂（选择黑色） 2.半透明信息（选择灰度信息）怎么选？通道,灰度就是中间色，

1. 混合剪贴法
2. 路径
   处理清晰轮廓
3. 调整边缘(先建立选区--输出到带有图层蒙版的图层（这样就可以用画笔进行了，很色遮罩，白色补上)
   注意输出完之后，蒙版作用没了之后删除( (前提只针对发丝，且是周边而不是里边）会提醒你进行运用），
   然后使用黑色画笔在头发周边刷一下，可以输出透明的毛发
   因为是透明色，是从蒙版中透明的输出部分，用黑色刷一下，所以刷出来了，他其实是有选区的
   但是此时必须锁定图层，不然穿透到下一层中，所以只在当前通道中涂绘信息，这是些多余信息，可以利用
   起来。
   然后可以用1ppt的画笔把一些毛发勾画出来

  可以结合下面的通道，当挑选通道、复制、并进行调节色阶，还可以进行平滑处理(3左右，消除锯齿，剪边）半径0.3像素左右(凡是存在选区
  羽化柔化边缘（对于清晰图像不需要，虚化边缘）  移动边缘--剪边效果）

  的情况（或者存在选择通道情况下都可以进行选择性遮罩）
4. 画笔
5. 通道
   通道做颜色信息存储，叫做黑色代表颜色多点，白色代表没有
   通道做选区信息存储，叫做黑色代表遮罩，白色代表不遮罩
   1. 挑选通道（黑白--灰度透明）--挑出本体为黑色的地方（针对颜色通道来说代表颜色多的地方）
   2. 复制通道---alpha通道（得到选区通道）
   3. 调节色阶（黑白最大化或者灰度最大化 黑的越黑，白的越白）---让选区更准确
   4. 上面几个通道只是为了获得选区,获得大部分区域。载入选区--有两种方式-ctrl+j（通过选区建立图层） 另一种就是绘制
      
   上述方法不适合人像，存在复杂背景情况下，反而是在绘画中可能有用，想要不抓出来形状。
6. 最差劲选择工具
 方便快捷，但是得切到蒙版模式编辑，这样就可以删除和恢复了。（蒙版编辑在工具栏的下面一个矩形+内部圆形)
 这样就可以使用黑白画笔进行修改 , 可以建立一个灰色背景（这样背景变成简单)！
7. 排列---》平铺很有用---》把添加进来的素材建立一个组（Ctrl+G)
8. 污点修复画笔很好用，细节线修复（抹掉，用背景色填充，通过新建一个图层，
9. 图章更细节修复（沿着一个方向修复）---一定选择当前层（不要选择所有层---肯定会忘记）
  
原来也可以使用新建图层----然后施加选区-----再使用画笔工具进行绘制即可【这是之前没有使用过的】
图层+通道+画笔 反复来反复去进行使用,通道定型，画笔绘色，图层进行混合（图层可以锁定）

多层添加（光和阴影类似）---光（通过铺白色面）然后进行模糊--高斯模糊（特别常用的滤镜工具)--建一个快捷键---编辑---快捷键CTRL+Alt+Shift+G

图层-复制--到新建的菜单。


之前学过红色红外线--

现在还有一个黑色背景下进行单色通道填充选项，两个图层可以看到很好的效果。（红蓝、红绿的图层还可以进行移动额）
图层可以进行透视、变形、编辑，产生阴影，构成3D效果。

制作工程都不拼合图层，而是通过组，组还可以建蒙版---一样的效果，一堆玻璃纸而已。

专色选区填充黑色，经常用于做专色图版和阴影图版！（阴影，光源--物体---阴影域，三点一线即可，再做高斯模糊）

创建剪贴模板（上层的颜色(画笔绘制）和形状(通道）融合——---混合剪贴法）真棒！！！！！
新建一个空白图层--然后在剪贴层进行画笔绘制，然后通过画笔吸管，吸收杂边颜色，太棒，然后再利用上下
两层的颜色混合即可！一边用混合一边用剪贴！！

剪贴图层（就是只针对下一图层进行操作，一定要学会用Alt+鼠标左键点击图层。（选择区域可以直接间断删除，他们只是alpha通道值)


Alt+鼠标左键还可以点击鼠标左右键。专门复制光（做细节处理）---太棒了。

操控变形和消失点感觉有点像。！



渐变工具箱---也可以通过吸管拾取颜色


路径--可以贴出边缘来，新建一个选区---清晰轮廓通过路径--配合调整边缘
点击---然后不要添加断开鼠标节点。
** DONE [#B] 确认小巴车（跟司机打电话） <2018-11-12 周一 16:22>        :@NCEPU:
CLOSED: [2018-11-17 周六 21:25] DEADLINE: <2018-11-16 周五>
                    :PROPERTIES:
                    :Effort: 0:30
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-11-17 周六 21:25]
                    CLOCK: [2018-11-12 周一 16:22]--[2018-11-12 周一 16:22] =>  0:00
                    :END:
                    
                    
确认
** DONE [#B] 确认康老师入住宾馆 <2018-11-13 周二 13:21>                :@NCEPU:
CLOSED: [2018-11-17 周六 21:25] DEADLINE: <2018-11-16 周五>
                    :PROPERTIES:
                    :Effort: 0:30
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "TODO"          T:[2018-11-17 周六 21:25]
                    CLOCK: [2018-11-13 周二 13:21]--[2018-11-13 周二 13:24] =>  0:03
                    - Clocked out on T:[2018-11-13 周二 13:24] \\
                      确定
                    :END:
** TODO [#C] 内工大博士交流 <2018-11-21 周三 18:07>                    :@NCEPU:
DEADLINE: <2018-12-15 周六>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2018-11-21 周三 19:40]--[2018-11-21 周三 19:41] =>  0:01
                    - Clocked out on T:[2018-11-21 周三 19:41]
                    CLOCK: [2018-11-21 周三 18:08]--[2018-11-21 周三 18:11] =>  0:03
                    :END:
                    
                    
             
赵元星博士       

璈嬁高娃
奥登是星星的意思

高娃是美丽的意思
** TODO [#B] 练车 <2018-11-29 周四 14:31>                           :@NCEPU:
DEADLINE: <2018-12-06 周四>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2018-11-29 周四 14:31]--[2018-11-29 周四 14:32] =>  0:01
                    :END:
** TODO [#B] 练车2 <2018-11-29 周四 14:32>                          :@NCEPU:
DEADLINE: <2018-12-07 周五>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
** TODO [#B] 摩托车考试 <2018-11-29 周四 14:35>                     :@NCEPU:
DEADLINE: <2018-12-10 周一>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2018-11-29 周四 14:33]--[2018-11-29 周四 14:33] =>  0:00
                    :END:
** PENDING [#B] 下午四点训练自己40min <2018-12-02 周日 15:49 +1d>   :@NCEPU:
DEADLINE: <2019-03-02 周六>
                    :PROPERTIES:
                    :Effort: 0:30
                    :LAST_REPEAT: [2018-12-05 周三 00:21]
                    :END:
                    :LOGBOOK:
                    - State "DONE"       from "PENDING"    T:[2018-12-05 周三 00:21]
                    - State "DONE"       from "TODO"          T:[2018-11-30 周五 19:30]
                    CLOCK: [2018-11-30 周五 08:50]--[2018-11-30 周五 08:51] =>  0:01
                    :END:
                    
                    
争取每天做到
** TODO [#B] 博士大论文写作 <2018-11-30 周五 11:47>[0%]                  :学术:
DEADLINE: <2019-03-25 周一>
                    :PROPERTIES:
                    :Effort: 4:00
                    :CATEGORY: Thesis
                    :END:
                    :LOGBOOK:
                    - State "TODO"       from "TODO"          T:[2018-11-30 周五 11:49]
                    CLOCK: [2018-11-30 周五 11:47]--[2018-11-30 周五 14:48] =>  3:01
                    - Clocked out on T:[2018-11-30 周五 14:48] \\
                      done
                    :END:
                    
*** TODO 第一章 引言
*** TODO 第一章 方法
*** TODO 第一章 验证
*** TODO 第一章 Yawing
*** TODO 第一章 Platform motion
** TODO [#A] 11点睡觉|7点起床 <2018-12-04 周二 10:48 +1d>              :@NCEPU:
                    :PROPERTIES:
                    :Effort: 0:30
                    :END:
                    :LOGBOOK:
                    CLOCK: [2018-12-04 周二 10:48]--[2018-12-04 周二 10:49] =>  0:01
                    :END:
                    
                    
                    

